Repository: squid-cache/squid
Catalog: doc/manuals/*.po
Languages: sv

source: Note that if NT guest user access is allowed on the PDC, an B<OK> message may be returned instead of B<ERR>
sv: Observera att om NT-gästanvändaråtkomst är tillåten på PDC kan ett B<OK> -meddelande returneras istället för B<ERR>

source: Test that entering a valid username and password results in an B<OK> message.
sv: Testa att ett giltigt användarnamn och lösenord resulterar i ett B<OK> -meddelande.

source: Test that entering a guest username and password returns the correct response for the site's access policy.
sv: Testa att inmatning av ett gästanvändarnamn och lösenord ger rätt svar för webbplatsens åtkomstpolicy.

source: Based on prior work by
sv: Baserat på tidigare arbete av

source: digest_file_auth - File based digest authentication helper for Squid.
sv: digest_file_auth - Filbaserad hjälp för digest-autentisering för Squid.

source: file
sv: fil

source: B<digest_file_auth> is an installed binary authentication program for Squid. It handles digest authentication protocol and authenticates against a text file backend.
sv: B<digest_file_auth> är ett installerat binärt autentiseringsprogram för Squid. Det hanterar digest-autentiseringsprotokollet och autentiserar mot en textfil-backend.

source: This program will automatically detect the existence of a concurrency channel-ID and adjust appropriately. It may be used with any value 0 or above for the auth_param children concurrency= parameter.
sv: Detta program kommer automatiskt att upptäcka förekomsten av ett kanal-ID för samtidighet och justera sig därefter. Det kan användas med vilket värde som helst på 0 eller högre för parametern auth_param children concurrency=.

source: Accept digest hashed passwords rather than plaintext in the password file
sv: Acceptera hashade lösenord istället för klartext i lösenordsfilen

source: Username database file format:
sv: Användarnamnets databasfilformat:

source: - comment lines are possible and should start with a '#';
sv: - kommentarer är möjliga och ska börja med ett '#';

source: - empty or blank lines are possible;
sv: - tomma eller blanka rader är möjliga;

source: - plaintext entry format is username:password
sv: - formatet för inmatning av klartext är användarnamn:lösenord

source: - HA1 entry format is username:realm:HA1
sv: - HA1-inmatningsformatet är användarnamn:realm:HA1

source: To build a directory integrated backend, you need to be able to calculate the HA1 returned to squid. To avoid storing a plaintext password you can calculate B<MD5(username:realm:password)> when the user changes their password, and store the tuple B<username:realm:HA1.> then find the matching B<username:realm> when squid asks for the HA1.
sv: För att bygga en katalogintegrerad backend måste du kunna beräkna HA1 som returneras till squid. För att undvika att lagra ett lösenord i klartext kan du beräkna B<MD5(username:realm:password)> när användaren ändrar sitt lösenord och lagra tuplen B<username:realm:HA1.> och sedan hitta matchande B<username:realm> när squid begär HA1.

source: This implementation could be improved by using such a triple for the file format. However storing such a triple does little to improve security: If compromised the B<username:realm:HA1> combination is "plaintext equivalent" - for the purposes of digest authentication they allow the user access. Password synchronization is not tackled by digest - just preventing on the wire compromise.
sv: Denna implementering skulle kunna förbättras genom att använda en sådan trippel för filformatet. Att lagra en sådan trippel förbättrar dock inte säkerheten i någon större utsträckning: Om den komprometteras är kombinationen B<username:realm:HA1> -”motsvarande klartext” – för ändamålet med digest-autentisering ger de användaren åtkomst. Lösenordssynkronisering hanteras inte av digest – det förhindrar bara kompromettering över nätverket.

source: negotiate_kerberos_auth - Squid kerberos based authentication helper
sv: negotiate_kerberos_auth - Squid Kerberos-baserad autentiseringshjälp

source: B<negotiate_kerberos_auth> is an installed binary and allows Squid to authenticate users via the Negotiate protocol and Kerberos.
sv: B<negotiate_kerberos_auth> är en installerad binärfil som gör det möjligt för Squid att autentisera användare via Negotiate-protokollet och Kerberos.

source: Remove realm from username before returning the username to squid.
sv: Ta bort realm från användarnamnet innan du skickar tillbaka användarnamnet till squid.

source: Provide Service Principal Name.
sv: Ange tjänstens huvudnamn.

source: Provide Kerberos Keytab Name (Default: /etc/krb5.keytab)
sv: Ange Kerberos Keytab-namn (standard: /etc/krb5.keytab)

source: Provide Replay Cache Directory (Default: /var/tmp)
sv: Ange katalog för återuppspelningscache (standard: /var/tmp)

source: Provide Replay Cache Type (Default: dfl)
sv: Ange typ av återuppspelningscache (standard: dfl)

source: This helper is intended to be used as an B<authentication> helper in B<squid.conf.>
sv: Denna hjälpfunktion är avsedd att användas som en B<authentication> -hjälpfunktion i B<squid.conf.>

source: Add the following lines to the squid startup script to point squid to a keytab file which contains the HTTP/fqdn service principal for the default Kerberos domain. The keytab name can also be provided by the -k E<lt>keytab nameE<gt> option. The fqdn must be the proxy name set in IE or firefox. You can not use an IP address.
sv: Lägg till följande rader i squids startskript för att peka squid till en keytab-fil som innehåller HTTP/fqdn-tjänstprincipalen för standarddomänen Kerberos. Keytab-namnet kan också anges med flaggan -k E<lt>keytab nameE<gt>. Fqdn måste vara det proxynamn som är inställt i IE eller Firefox. Du kan inte använda en IP-adress.

source: Kerberos can keep a replay cache to detect the reuse of Kerberos tickets (usually only possible in a 5 minute window) . If squid is under high load with Negotiate(Kerberos) proxy authentication requests the replay cache checks can create high CPU load. If the environment does not require high security the replay cache check can be disabled for MIT based Kerberos implementations by adding the below to the startup script or use the -t none option.
sv: Kerberos kan spara en replay-cache för att upptäcka återanvändning av Kerberos-biljetter (vanligtvis endast möjligt inom ett 5-minutersfönster). Om squid är högt belastat med Negotiate(Kerberos)-proxyautentiseringsförfrågningar kan replay-cachekontrollerna skapa hög CPU-belastning. Om miljön inte kräver hög säkerhet kan replay-cachekontrollen inaktiveras för MIT-baserade Kerberos-implementeringar genom att lägga till nedanstående i startskriptet eller använda flaggan -t none.

source: KRB5RCACHETYPE=none export KRB5RCACHETYPE
sv: KRB5RCACHETYPE=none exportera KRB5RCACHETYPE

source: If negotiate_kerberos_auth doesn't determine for some reason the right service principal you can provide it with -s HTTP/fqdn.
sv: Om negotiate_kerberos_auth av någon anledning inte kan fastställa rätt tjänstprincipal kan du ange den med -s HTTP/fqdn.

source: If you serve multiple Kerberos realms add a HTTP/fqdn@REALM service principal per realm to the HTTP.keytab file and use the -s GSS_C_NO_NAME option with negotiate_kerberos_auth.
sv: Om du betjänar flera Kerberos-domäner lägger du till en HTTP/fqdn@REALM-tjänstprincipal per domän till filen HTTP.keytab och använder flaggan -s GSS_C_NO_NAME med negotiate_kerberos_auth.

source: * Copyright (C) 1996-2014 The Squid Software Foundation and contributors * * Squid software is distributed under GPLv2+ license and includes * contributions from numerous individuals and organizations. * Please see the COPYING and CONTRIBUTORS files for details.
sv: * Copyright (C) 1996-2014 The Squid Software Foundation och bidragsgivare * * Squid-programvaran distribueras under GPLv2+-licens och innehåller * bidrag från ett stort antal individer och organisationer. * Se filerna COPYING och CONTRIBUTORS för mer information.

source: B<RFC4559> - SPNEGO-based Kerberos and NTLM HTTP Authentication in Microsoft Windows,
sv: B<RFC4559> - SPNEGO-baserad Kerberos- och NTLM HTTP-autentisering i Microsoft Windows,

source: B<RFC2478> - The Simple and Protected GSS-API Negotiation Mechanism,
sv: B<RFC2478> - Den enkla och skyddade GSS-API-förhandlingsmekanismen,

source: B<RFC1964> - The Kerberos Version 5 GSS-API Mechanism,
sv: B<RFC1964> - Kerberos version 5 GSS-API-mekanismen,

source: ntlm_sspi_auth.exe - Native Windows NTLM/NTLMv2 authenticator for Squid
sv: ntlm_sspi_auth.exe – Inbyggd Windows NTLM/NTLMv2-autentiserare för Squid

source: B<ntlm_sspi_auth.exe> is an installed binary built on Windows systems. It provides native access to the Security Service Provider Interface of Windows for authenticating with NTLM / NTLMv2. It has automatic support for NTLM NEGOTIATE packets.
sv: B<ntlm_sspi_auth.exe> är en installerad binärfil som är byggd på Windows-system. Den ger inbyggd åtkomst till Windows Security Service Provider Interface för autentisering med NTLM / NTLMv2. Den har automatiskt stöd för NTLM NEGOTIATE-paket.

source: Specify a Windows Local Group name allowed to authenticate.
sv: Ange ett Windows-lokalt gruppnamn som får autentisera sig.

source: Specify a Windows Local Group name which is to be denied authentication.
sv: Ange ett namn på en lokal Windows-grupp som ska nekas autentisering.

source: Enables verbose NTLM packet debugging.
sv: Aktiverar detaljerad felsökning av NTLM-paket.

source: Users that are allowed to access the web proxy must have the Windows NT User Rights "logon from the network".
sv: Användare som har tillåtelse att använda webbproxyn måste ha Windows NT-användarrättigheten "logga in från nätverket".

source: Optionally the authenticator can verify the NT LOCAL group membership of the user against the User Group specified in the Authenticator's command line.
sv: Alternativt kan autentiseraren verifiera användarens medlemskap i NT LOCAL-gruppen mot den användargrupp som anges i autentiserarens kommandorad.

source: This can be accomplished creating a local user group on the NT machine, grant the privilege, and adding users to it, it works only with MACHINE Local Groups, not Domain Local Groups.
sv: Detta kan åstadkommas genom att skapa en lokal användargrupp på NT-maskinen, bevilja behörigheten och lägga till användare till den. Det fungerar endast med lokala grupper på MASKINEN, inte lokala grupper i domänen.

source: Better group checking is available with external ACL, see B<ext_ad_group_acl.exe> documentation.
sv: Bättre gruppkontroll är tillgänglig med extern ACL, se dokumentationen för B<ext_ad_group_acl.exe>.

source: B<squid.conf> typical minimal required changes:
sv: B<squid.conf> typiska minimikrav på ändringar:

source: Refer to Squid documentation for more details.
sv: Se Squids dokumentation för mer information.

source: Internet Explorer has some problems with B<ftp://> URLs when handling internal Squid FTP icons. The following B<squid.conf> ACL works around this when placed before the authentication ACL:
sv: Internet Explorer har vissa problem med B<ftp://>-URL:er vid hantering av interna Squid FTP-ikoner. Följande B<squid.conf> ACL löser detta när den placeras före autentiserings-ACL:

source: Based on prior work in by
sv: Baserat på tidigare arbete i av

source: security_file_certgen - SSL certificate generator for Squid.
sv: security_file_certgen - SSL-certifikatgenerator för Squid.

source: directory
sv: katalog

source: size
sv: storlek

source: serial number
sv: serienummer

source: B<security_file_certgen> is an installed binary.
sv: B<security_file_certgen> är en installerad binärfil.

source: Because the generation and signing of SSL certificates takes time Squid must use external process to handle the work.
sv: Eftersom det tar tid att generera och signera SSL-certifikat måste Squid använda en extern process för att hantera arbetet.

source: This process generates new SSL certificates and uses a disk cache of certificates to improve response times on repeated requests. Communication occurs via TCP sockets bound to the loopback interface.
sv: Denna process genererar nya SSL-certifikat och använder en diskcache med certifikat för att förbättra svarstiderna vid upprepade förfrågningar. Kommunikationen sker via TCP-socklar som är kopplade till loopback-gränssnittet.

source: File system block size in bytes. Needed for processing natural size of certificate on disk. Default value is 2048 bytes.
sv: Filsystemets blockstorlek i byte. Behövs för att bearbeta certifikatets naturliga storlek på disken. Standardvärdet är 2048 byte.

source: Initialize the SSL storage database and exit. Requires the B<-s> option to determine the storage location being created.
sv: Initialisera SSL-lagringsdatabasen och avsluta. Kräver flaggan B<-s> för att bestämma vilken lagringsplats som ska skapas.

source: Display the current serial number using stderr and exit. Requires B<-s> option to determine which storage directory the serial is located in.
sv: Visa det aktuella serienumret med stderr och avsluta. Kräver flaggan B<-s> för att avgöra i vilken lagringskatalog serienumret finns.

source: Directory path of disk storage for new SSL certificates.
sv: Katalogväg till disklagring för nya SSL-certifikat.

source: Maximum size of SSL certificate disk storage.
sv: Maximal storlek på SSL-certifikatets diskutrymme.

source: HEX B<serial number > to use when initializing an SSL storage database. The default value of serial number is the number of seconds since Epoch minus 1200000000.
sv: HEX B<serial number > -värde som används vid initialisering av en SSL-lagringsdatabas. Standardvärdet för serienummer är antalet sekunder sedan Epoch minus 1200000000.

source: Display the binary version details using stderr.
sv: Visa information om binärversionen med stderr.

source: B<SSL errors after changing the CA>
sv: B<SSL-fel efter ändring av CA>

source: Certificates are stored in this database in signed form. After any change to the signing CA in squid.conf be sure to erase and re-initialize the certificate database.
sv: Certifikat lagras i denna databas i signerad form. Efter varje ändring av signeringscertifikatutfärdaren i squid.conf måste du radera och återinitialisera certifikatdatabasen.

source: B<Certificate chaining>
sv: B<Certifikatkedjning>

source: The version 1.0 of this helper will not add chained intermediate CA certificates. The client must have a full chain of trust from the root CA all the way down to the end certificate generated by this program.
sv: Version 1.0 av detta hjälpmedel lägger inte till kedjade mellanliggande CA-certifikat. Klienten måste ha en fullständig förtroendekedja från rot-CA hela vägen ner till det slutcertifikat som genereras av detta program.

source: Signing with an intermediate CA needs to install both the root and the intermediate public CA on the clients.
sv: Vid signering med en mellanliggande certifikatutfärdare måste både rotcertifikatet och det mellanliggande offentliga certifikatet installeras på klienterna.

source: Before this helper can be used the storage area for new certificates must be initialized manually. This is done from the command line using the B<-c> parameters.
sv: Innan detta hjälpmedel kan användas måste lagringsutrymmet för nya certifikat initialiseras manuellt. Detta görs från kommandoraden med hjälp av B<-c> -parametrarna.

source: For example:
sv: Till exempel:

source: For simple configuration the helper defaults can be used. Only HTTP listening port options are required to enable generation and set the signing CA certificate. For Example:
sv: För enkel konfiguration kan hjälpfunktionernas standardinställningar användas. Endast flaggor för HTTP-lyssningsport krävs för att aktivera generering och ställa in signeringscertifikatet. Till exempel:

source: For more customized configuration the helper certificate storage directory location and size can be altered with the B<sslcrtd_program> configuration directive. For example:
sv: För mer anpassad konfiguration kan hjälpcertifikatets lagringskatalog och storlek ändras med konfigurationsdirektivet B<sslcrtd_program>. Till exempel:

source: squid - HTTP web proxy caching server
sv: squid - HTTP-webbproxy-caching-server

source: facility
sv: anläggning

source: config-file
sv: konfigurationsfil

source: service-name
sv: tjänstens namn

source: command-line
sv: kommandorad

source: B<squid> is a high-performance proxy caching server for web clients, supporting FTP, gopher, ICAP, ICP, HTCP and HTTP data objects. Unlike traditional caching software, Squid handles all requests in a single, non-blocking process.
sv: B<squid> är en högpresterande proxy-caching-server för webbklienter som stöder FTP-, gopher-, ICAP-, ICP-, HTCP- och HTTP-dataobjekt. Till skillnad från traditionell caching-programvara hanterar Squid alla förfrågningar i en enda, icke-blockerande process.

source: Squid keeps meta data and especially hot objects cached in RAM, caches DNS lookups, supports non-blocking DNS lookups, and implements negative caching of failed requests.
sv: Squid lagrar metadata och särskilt populära objekt i RAM-minnet, cachar DNS-sökningar, stöder icke-blockerande DNS-sökningar och implementerar negativ cachning av misslyckade förfrågningar.

source: Squid supports SSL, extensive access controls, and full request logging. By using the lightweight Internet Cache Protocols ICP, HTCP or CARP, Squid caches can be arranged in a hierarchy or mesh for additional bandwidth savings.
sv: Squid stöder SSL, omfattande åtkomstkontroller och fullständig loggning av förfrågningar. Genom att använda de lättviktiga Internet Cache Protocols ICP, HTCP eller CARP kan Squid-cacher ordnas i en hierarki eller ett nätverk för ytterligare bandbreddsbesparingar.

source: Squid consists of a main server program B<squid> , some optional programs for custom processing and authentication, and some management and client tools. When squid starts up, it spawns a configurable number of helper processes, each of which can perform parallel lookups. This reduces the amount of time the cache waits for results.
sv: Squid består av ett huvudserverprogram B<squid>, några valfria program för anpassad bearbetning och autentisering, samt några administrations- och klientverktyg. När Squid startar skapas ett konfigurerbart antal hjälpprocesser, som var och en kan utföra parallella sökningar. Detta minskar den tid som cachen väntar på resultat.

source: Squid is derived from the ARPA-funded Harvest Project.
sv: Squid härstammar från det ARPA-finansierade Harvest-projektet.

source: This manual page only lists the command line arguments. For details on how to configure Squid see the file B<@SYSCONFDIR@/squid.conf.documented,> the Squid wiki FAQ and examples at http://wiki.squid-cache.org/ , or the configuration manual on the Squid home page
sv: Denna manual sida listar endast kommandoradsargument. För detaljer om hur man konfigurerar Squid, se filen B<@SYSCONFDIR@/squid.conf.documented,> Squid wiki FAQ och exempel på http://wiki.squid-cache.org/ , eller konfigurationsmanualen på Squids webbplats

source: Specify HTTP port number where Squid should listen for requests, in addition to any B<http_port> specifications in B<squid.conf>
sv: Ange HTTP-portnummer där Squid ska lyssna efter förfrågningar, utöver eventuella B<http_port>-specifikationer i B<squid.conf>

source: Do not catch fatal signals.
sv: Fånga inte upp ödesdigra signaler.

source: Write debugging to stderr also.
sv: Skriv också felsökning till stderr.

source: Use the given config-file instead of B<@SYSCONFDIR@/squid.conf .> If the file name starts with a B<!> or B<|> then it is assumed to be an external command or command line. Can for example be used to pre-process the configuration before it is being read by Squid. To facilitate this Squid also understands the common #line notion to indicate the real source file.
sv: Använd den angivna konfigurationsfilen istället för B<@SYSCONFDIR@/squid.conf .> Om filnamnet börjar med B<!> eller B<|> antas det vara ett externt kommando eller en kommandorad. Kan till exempel användas för att förbehandla konfigurationen innan den läses av Squid. För att underlätta detta förstår Squid också det vanliga #line-begreppet för att ange den verkliga källfilen.

source: Don't serve any requests until store is rebuilt.
sv: Svara inte på några förfrågningar förrän butiken har byggts om.

source: Print help message.
sv: Skriv ut hjälpmelding.

source: Install as a Windows Service (see B<-n> option).
sv: Installera som en Windows-tjänst (se flaggan B<-n> ).

source: Parse configuration file, then send signal to running copy (except B<-k parse> ) and exit.
sv: Analysera konfigurationsfilen, skicka sedan signal till körande kopia (utom B<-k parse> ) och avsluta.

source: Use specified syslog facility. Implies B<-s>
sv: Använd specificerad syslog-funktion. Implicerar B<-s>

source: Specify Windows Service name to use for service operations, default is: B<Squid>
sv: Ange Windows-tjänstens namn som ska användas för tjänsteoperationer. Standardvärdet är: B<Squid>

source: No daemon mode.
sv: Inget daemon-läge.

source: Parent process does not exit until its children have finished. It has no effect with B<-N> which does not fork/exit at startup.
sv: Föräldraprocessen avslutas inte förrän dess barnprocesser är färdiga. Det har ingen effekt med B<-N>, som inte förgrenar sig/avslutas vid start.

source: Set Windows Service Command line options in Registry.
sv: Ställ in kommandoradsflaggor för Windows-tjänster i registret.

source: Remove a Windows Service (see B<-n> option).
sv: Ta bort en Windows-tjänst (se flaggan B<-n> ).

source: Do not set B<REUSEADDR> on port.
sv: Ställ inte in B<REUSEADDR> en på porten.

source: Enable logging to syslog. Also configurable in B<@SYSCONFDIR@/squid.conf>
sv: Aktivera loggning till syslog. Kan även konfigureras i B<@SYSCONFDIR@/squid.conf>

source: Double-check swap during rebuild.
sv: Dubbelkolla swap under ombyggnaden.

source: Specify ICP port number (default: 3130), disable with 0.
sv: Ange ICP-portnummer (standard: 3130), inaktivera med 0.

source: Print version and build details.
sv: Utskriftsversion och byggnadsdetaljer.

source: Force full debugging.
sv: Tvinga fullständig felsökning.

source: Only return B<UDP_HIT> or B<UDP_MISS_NOFETCH> during fast reload.
sv: Returnera endast B<UDP_HIT> eller B<UDP_MISS_NOFETCH> under snabb omladdning.

source: Create missing swap directories and other missing cache_dir structures, then exit. All cache_dir types create the configured top-level directory if it is missing. Other actions are type-specific. For example, ufs-based storage systems create missing L1 and L2 directories while Rock creates the missing database file.
sv: Skapa saknade swap-kataloger och andra saknade cache_dir-strukturer, och avsluta sedan. Alla cache_dir-typer skapar den konfigurerade toppnivåkatalogen om den saknas. Övriga åtgärder är typspecifika. Till exempel skapar ufs-baserade lagringssystem saknade L1- och L2-kataloger, medan Rock skapar den saknade databasfilen.

source: This option does not enable validation of any present swap structures. Its focus is on creation of missing pieces. If nothing is missing, squid -z just exits. If you suspect cache_dir corruption, you must delete the top-level cache_dir directory before running squid -z.
sv: Den här flaggan aktiverar inte validering av några befintliga swapstrukturer. Det fokuserar på att skapa saknade delar. Om inget saknas avslutas squid -z bara. Om du misstänker att cache_dir är skadad måste du ta bort cache_dir-katalogen på högsta nivå innan du kör squid -z.
