Repository: squid-cache/squid
Catalog: doc/manuals/*.po
Languages: sv

source: Send B<string> as User-Agent: header. To omit the header completely set string to empty ('').
sv: Skicka B<sträng> som User-Agent: header. För att utelämna rubriken helt, ange en tom sträng ('').

source: Retrieve URL from server host. Default is B<localhost>
sv: Hämta URL från servervärd. Standard är B<localhost>

source: Extra headers to send. Use B<'\en'> for new lines.
sv: Extra rubriker att skicka. Använd B<'\en'> för nya rader.

source: If-Modified-Since time (in Epoch seconds).
sv: If-Modified-Since-tid (i Epoch-sekunder).

source: Host header content
sv: Innehåll i Host-rubriken

source: Keep the connection active. Default is to do only one request then close.
sv: Håll anslutningen aktiv. Standardinställningen är att endast göra en begäran och sedan stänga.

source: Specify a local IP address to bind to. Default is none.
sv: Ange en lokal IP-adress att binda till. Standard är ingen.

source: Request method, default is I<GET.> Squid also supports a non-standard method called I<PURGE.> You can use that to purge a specific URL from the cache. You need to have I<purge> access setup in B<squid.conf> similar to I<manager> access. Here is an example:
sv: Begär metod, standard är I<GET.> Squid stöder också en icke-standardmetod som kallas I<PURGE.> Du kan använda den för att rensa en specifik URL från cachen. Du måste ha I<purge> -åtkomst inställd i B<squid.conf> på samma sätt som I<manager> -åtkomst. Här är ett exempel:

source: Proxy Negotiate(Kerberos) authentication.
sv: Proxy Negotiate (Kerberos) autentisering.

source: Use kinit username@DOMAIN first to get initial TGS.
sv: Använd först kinit användarnamn@DOMAIN för att få initial TGS.

source: WWW Negotiate(Kerberos) authentication.
sv: WWW Förhandla (Kerberos) autentisering.

source: Port number of cache. Default is 3128.
sv: Portnummer för cache. Standardvärdet är 3128.

source: Request body. Using the named file as data.
sv: Begäran. Använd den namngivna filen som data.

source: Force cache to reload URL.
sv: Tvinga cacheminnet att ladda om URL.

source: Silent. Do not print data to stdout.
sv: Tyst. Skriv inte ut data till stdout.

source: Trace I<count> HTTP relay or proxy hops
sv: Spåra I<count> a HTTP-relä eller proxyhopp

source: Timeout value (seconds) for read/write operations.
sv: Timeout-värde (sekunder) för läs-/skrivoperationer.

source: Proxy authentication username
sv: Användarnamn för proxyautentisering

source: WWW authentication username
sv: WWW-autentiseringsanvändarnamn

source: Verbose. Print outgoing message to stderr.
sv: Verbose. Skriv ut utgående meddelande till stderr.

source: HTTP Version. Use '-' for HTTP/0.9 omitted case
sv: HTTP-version. Använd '-' för HTTP/0.9 utelämnat fall

source: Proxy authentication password
sv: Lösenord för proxyautentisering

source: WWW authentication password
sv: WWW-autentiseringslösenord

source: Use Transport Layer Security on the HTTP connection.
sv: Använd Transport Layer Security på HTTP-anslutningen.

source: Use TLS with unauthenticated (anonymous) certificate.
sv: Använd TLS med oautentiserat (anonymt) certifikat.

source: File containing client X.509 certificate in PEM format. May be repeated to load several client certificates.
sv: Fil som innehåller klientcertifikat X.509 i PEM-format. Kan upprepas för att ladda flera klientcertifikat.

source: File containing trusted Certificate Authority (CA) certificates in PEM format. May be repeated to load any number of files.
sv: Fil som innehåller certifikat från betrodda certifikatutfärdare (CA) i PEM-format. Kan upprepas för att ladda valfritt antal filer.

source: TLS library specific parameters for the communication session. See the library documentation for details on valid parameters.
sv: TLS-biblioteksspecifika parametrar för kommunikationssessionen. Se bibliotekets dokumentation för mer information om giltiga parametrar.

source: If repeated only the last value will have effect.
sv: Om det upprepas kommer endast det sista värdet att ha effekt.

source: Enable ping mode. Optional -g and -I parameters must follow immediately if used. Repeated use resets to default ping settings.
sv: Aktivera ping-läge. Valfria parametrarna -g och -I måste anges omedelbart efter varandra om de används. Upprepad användning återställer till standardinställningarna för ping.

source: Ping mode, perform.I count iterations (default is to loop until interrupted).
sv: Ping-läge, utför. Jag räknar iterationer (standard är att loopa tills det avbryts).

source: Ping interval in seconds (default 1 second).
sv: Pingintervall i sekunder (standard 1 sekund).

source: Based on original code derived from Harvest and further developed by numerous individuals from the internet community.
sv: Baserad på originalkod som härstammar från Harvest och vidareutvecklats av ett stort antal personer från internetgemenskapen.
