Repository: squid-cache/squid
Catalog: doc/manuals/*.po
Languages: sv

source: By default, squid -z runs in daemon mode (so that configuration macros and other SMP features work as expected). Use B<-N> option to overwrite this.
sv: Som standard körs squid -z i daemon-läge (så att konfigurationsmakron och andra SMP-funktioner fungerar som förväntat). Använd flaggan B<-N> för att skriva över detta.

source: FILES
sv: FILER

source: Squid configuration files located in @SYSCONFDIR@/:
sv: Squid-konfigurationsfiler finns i @SYSCONFDIR@/:

source: The main configuration file. You must initially make changes to this file for B<squid> to work. For example, the default configuration only allows access from RFC private LAN networks. Some packaging distributions block even that.
sv: Huvudkonfigurationsfilen. Du måste först göra ändringar i denna fil för att B<squid> ska fungera. Till exempel tillåter standardkonfigurationen endast åtkomst från privata RFC-LAN-nätverk. Vissa paketdistributioner blockerar även det.

source: Reference copy of the configuration file. Always kept up to date with the version of Squid you are using.
sv: Referenskopia av konfigurationsfilen. Hålls alltid uppdaterad med den version av Squid som du använder.

source: Use this to look up the default configuration settings and syntax after upgrading.
sv: Använd detta för att slå upp standardkonfigurationsinställningarna och syntaxen efter uppgraderingen.

source: Use this to read the documentation for configuration options available in your build of Squid. The online configuration manual is also available for a full reference of options. B<see>http://www.squid-cache.org/Doc/config/
sv: Använd detta för att läsa dokumentationen för konfigurationsflaggor som finns tillgängliga i din version av Squid. Den onlinebaserade konfigurationsmanualen finns också tillgänglig för en fullständig referens av flaggan. B<see>http://www.squid-cache.org/Doc/config/

source: The main configuration file for the web B<cachemgr.cgi> tools.
sv: Huvudkonfigurationsfilen för webbverktygen B<cachemgr.cgi>.

source: The main configuration file for the Sample MSNT authenticator.
sv: Huvudkonfigurationsfilen för Sample MSNT-autentiseraren.

source: CSS Stylesheet to control the display of generated error pages. Use this to set any company branding you need, it will apply to every language Squid provides error pages for.
sv: CSS-stilmall för att styra visningen av genererade felsidor. Använd denna för att ställa in önskad företagsprofilering. Den kommer att tillämpas på alla språk som Squid tillhandahåller felsidor för.

source: Some files also located elsewhere:
sv: Vissa filer finns även på andra platser:

source: MIME type mappings for FTP gatewaying
sv: MIME-typ-mappningar för FTP-gatewaying

source: Location of Squid error pages and templates.
sv: Placering av Squids felsidor och mallar.

source: Squid was written over many years by a changing team of developers and maintained in turn by
sv: Squid har skrivits under många år av ett skiftande team av utvecklare och underhållits i tur och ordning av

source: With contributions from many others in the Squid community. see CONTRIBUTORS for a full list of individuals who contributed code. see CREDITS for a list of major code contributing copyright holders.
sv: Med bidrag från många andra i Squid-gemenskapen. Se BIDRAGSGIVARE för en fullständig lista över personer som bidragit med kod. Se KREDITERINGAR för en lista över de viktigaste upphovsrättsinnehavarna som bidragit med kod.

source: cachemgr.cgi - Squid HTTP proxy manager CGI web interface
sv: cachemgr.cgi – Squid HTTP-proxyhanterare CGI-webbgränssnitt

source: The cache manager ( B<cachemgr.cgi> ) is a CGI utility for displaying statistics about the Squid HTTP proxy process as it runs. The cache manager is a convenient way to manage the cache and view statistics without logging into the server.
sv: Cachehanteraren ( B<cachemgr.cgi> ) är ett CGI-verktyg för att visa statistik om Squid HTTP-proxyprocessen medan den körs. Cachehanteraren är ett bekvämt sätt att hantera cachen och visa statistik utan att logga in på servern.

source: Configuration examples for many common web servers can be found in the Squid FAQ wiki.
sv: Konfigurations exempel för många vanliga webbservrar finns i Squid FAQ wiki.

source: The access configuration file defining which Squid servers may be managed via this B<cachemgr.cgi> program. Each line specifies a B<server>:B<port> followed by an optional description
sv: Konfigurationsfilen som definierar vilka Squid-servrar som kan hanteras via detta B<cachemgr.cgi> -program. Varje rad anger en B<server>:B<port> följt av en valfri beskrivning

source: The server name may contain shell wildcard characters such as *, [] etc. A quick selection dropdown menu is automatically constructed from the simple server names.
sv: Servernamnet kan innehålla jokertecken som *, [] etc. En snabbvalmeny skapas automatiskt utifrån de enkla servernamnen.

source: Specifying :port is optional. If not specified then the default proxy port is assumed. :* or :any matches any port on the target server.
sv: Att ange :port är valfritt. Om det inte anges används standardproxyporten. :* eller :any matchar alla portar på målservrarna.

source: SECURITY
sv: SÄKERHET

source: B<cachemgr.cgi> calls the requested server on the requested port using HTTP and returns a formatted version of the response. To avoid abuse it is recommended to configure your web server to restrict access to the B<cachemgr.cgi> program.
sv: B<cachemgr.cgi> anropar den begärda servern på den begärda porten med hjälp av HTTP och returnerar en formaterad version av svaret. För att undvika missbruk rekommenderas att du konfigurerar din webbserver så att åtkomsten till programmet B<cachemgr.cgi> begränsas.

source: Derived from Harvest. Further developed by numerous individuals from the internet community. Development is led by Duane Wessels of the National Laboratory for Applied Network Research and funded by the National Science Foundation.
sv: Härstammar från Harvest. Vidareutvecklat av ett stort antal personer från internetgemenskapen. Utvecklingen leds av Duane Wessels från National Laboratory for Applied Network Research och finansieras av National Science Foundation.

source: See http://wiki.squid-cache.org/SquidFaq/BugReporting for details of what you need to include with your bug report.
sv: Se http://wiki.squid-cache.org/SquidFaq/BugReporting för mer information om vad du behöver inkludera i din felrapport.

source: purge - magnifying glass into your squid cache
sv: purge - förstoringsglas in i din squid-cache

source: B<purge> is used to have a look at what URLs are stored in which file within your cache. The B<purge> tool can also be used to release objects which URLs match user specified regular expressions. A more troublesome feature is the ability to remove files B<squid> does not seem to know about any longer.
sv: B<purge> används för att se vilka URL:er som lagras i vilken fil i din cache. Verktyget B<purge> kan också användas för att frigöra objekt vars URL:er matchar användardefinierade reguljära uttryck. En mer besvärlig funktion är möjligheten att ta bort filer som B<squid> inte längre verkar känna till.

source: This is a tool for expert usage only, use it under your own responsibility.
sv: Detta är ett verktyg endast för experter, använd det på eget ansvar.

source: a kind of "i am alive" flag. It can only be activated, if your stdout is a tty. If active, it will display a little rotating line to indicate that there is actually something happening. You should not use this switch if you capture your stdout in a file or if your expression list produces many matches. The -a flag is also incompatible with the (default) multi cache_dir mode.
sv: en sorts "jag lever"-flagga. Den kan endast aktiveras om din stdout är en tty. Om den är aktiv visas en liten roterande linje för att indikera att något faktiskt händer. Du bör inte använda denna switch om du fångar din stdout i en fil eller om din uttryckslista ger många träffar. Flaggan -a är också oförenlig med (standard) multi cache_dir-läget.

source: default: off See also: -n
sv: standard: av Se även: -n

source: this option lets you specify the location of the squid.conf file. Purge understands about more than one cache_dir, and does so by parsing squid.conf. It knows about both ways of Squid-2 cache_dir specifications, and will automatically try to use the correct one.
sv: med den här flaggan kan du ange platsen för filen squid.conf. Purge förstår mer än en cache_dir och gör detta genom att analysera squid.conf. Det känner till båda sätten att ange cache_dir i Squid-2 och försöker automatiskt använda det rätta.

source: default: /usr/local/squid/etc/squid.conf
sv: standard: /usr/local/squid/etc/squid.conf

source: if you want to rescue files from your cache, you need to specify the directory into which the files will be copied. Please note that purge will try to establish the original server directory structure. This switch also activates copy-out mode. Please do not use copy-out mode with any purge mode (-P) other than 0.
sv: om du vill rädda filer från din cache måste du ange den katalog som filerna ska kopieras till. Observera att purge försöker återskapa den ursprungliga serverkatalogstrukturen. Denna switch aktiverar också kopieringsläget. Använd inte kopieringsläget med något annat purge-läge (-P) än 0.

source: For instance, if you specified "-C /tmp", purge will try to recreate /tmp/www.server.1/url/path/file, and so forth.
sv: Om du till exempel angav "-C /tmp" kommer purge att försöka återskapa /tmp/www.server.1/url/path/file och så vidare.

source: default: off See also: -H, -P
sv: standard: av Se även: -H, -P

source: lets you specify a debug level. Different bits are reserved for different output.
sv: låter dig ange en felsökningsnivå. Olika bitar är reserverade för olika utdata.

source: default: 0
sv: standard: 0

source: Specify one regular expression to be searched for in the cache. This is useful if there is only a handful of objects you want to check. Please remember to escape the shell meta characters used in your regular expression. The use of single quotes around your expression is recommended. The capital letter version works case sensitive, the lower caps version does not.
sv: Ange ett reguljärt uttryck som ska sökas efter i cachen. Detta är användbart om det bara finns ett fåtal objekt som du vill kontrollera. Kom ihåg att undvika de metatecken som används i ditt reguljära uttryck. Vi rekommenderar att du använder enkla citattecken runt ditt uttryck. Versionen med versaler är skiftlägeskänslig, medan versionen med gemener inte är det.

source: default: (no default)
sv: standard: (ingen standard)

source: if you have more than a handful of expressions, or want to check the same set at regular intervals, the file option might be more useful to you. Each line in the text file will be regarded as one regular expression. Again, the capital letter version works case sensitive, the lower caps version does not.
sv: om du har fler än ett fåtal uttryck eller vill kontrollera samma uppsättning med jämna mellanrum kan filflaggan vara mer användbar för dig. Varje rad i textfilen betraktas som ett reguljärt uttryck. Återigen är versionen med versaler skiftlägeskänslig, medan versionen med gemener inte är det.

source: if in copy-out mode (see: -C), you can specify to keep the HTTP Header in the recreated file.
sv: om du är i kopieringsläge (se: -C) kan du ange att HTTP-rubriken ska behållas i den återskapade filen.

source: default: off See also: -C
sv: standard: av Se även: -C

source: tell purge to process one cache_dir after another, instead of doing things in parallel. If you have more than one cache_dir in your configuration purge will fork off a worker process for each cache_dir to do the checks for optimum speed, assuming a decently designed cache. Since parallel execution will put quite some load on the system and its controllers, it is sometimes preferred to use less resources, though it will take longer.
sv: be purge att bearbeta en cache_dir efter en annan, istället för att göra saker parallellt. Om du har mer än en cache_dir i din konfiguration kommer purge att starta en arbetareprocess för varje cache_dir för att göra kontrollerna för optimal hastighet, förutsatt att cachen är ordentligt utformad. Eftersom parallell körning kommer att belasta systemet och dess styrenheter ganska mycket, är det ibland bättre att använda mindre resurser, även om det tar längre tid.

source: default: parallel mode for more than one cache_dir
sv: standard: parallellt läge för mer än en cache_dir

source: Some cache admins use a different port than 3128. The purge tool will need to connect to your cache in order to send the PURGE request (see -P). This option lets you specify the host and port to connect to. The port is optional. The port can be a name (check your /etc/services) or number. It is separated from the host name portion by a single colon, no spaces allowed.
sv: Vissa cacheadministratörer använder en annan port än 3128. Rensningsverktyget måste ansluta till din cache för att kunna skicka PURGE-begäran (se -P). Med den här flaggan kan du ange vilken värd och port du vill ansluta till. Porten är valfri. Porten kan vara ett namn (kontrollera din /etc/services) eller ett nummer. Den separeras från värdnamnet med ett enda kolon, utan mellanslag.

source: default: localhost:3128
sv: standard: localhost:3128

source: If you want to do more than just print your cache content, you will need to specify this option. Each bit is reserved for a different action. Only the use of the LSB is recommended, the rest should be considered experimental.
sv: Om du vill göra mer än bara skriva ut cacheinnehållet måste du ange denna flagga. Varje bit är reserverad för en annan åtgärd. Endast användning av LSB rekommenderas, resten bör betraktas som experimentellt.

source: B<no bit set: just print>
sv: B<<ingen bit inställd:\tbara utskrift>

source: B<bit#0 set: send PURGE for matches>
sv: B<bit#0 inställd: skicka PURGE för matchningar>

source: B<bit#1 set: unlink object file for 404 not found PURGEs>
sv: B<bit#1 inställd: koppla bort objektfil för 404 inte hittad PURGEs>

source: B<bit#2 set: unlink weird object files>
sv: B<bit#2 inställning: koppla bort konstiga objektfiler>

source: If you use a value other than 0 or 1, you will need to slow rebuild your cache content. A warning message will remind you of that. If you use bit#1, all unsuccessful PURGEs will result in the object file in your cache directory to be removed, because squid does not seem to know about it any longer. Beware that the asyncio might try to remove it after the purge tool, and thus complains bitterly. Bit#1 only makes sense, if Bit#0 is also set, otherwise it has no effect (since the HTTP status 404 is never returned).
sv: Om du använder ett annat värde än 0 eller 1 måste du långsamt återuppbygga ditt cacheminne. Ett varningsmeddelande påminner dig om detta. Om du använder bit#1 kommer alla misslyckade PURGE-kommandon att resultera i att objektfilen i din cachekatalog tas bort, eftersom squid inte längre verkar känna till den. Tänk på att asyncio kan försöka ta bort den efter rensningsverktyget och därmed klaga bittert. Bit#1 är bara meningsfullt om Bit#0 också är inställt, annars har det ingen effekt (eftersom HTTP-status 404 aldrig returneras).

source: Bit#2 is reserved for strange files which do not even contain a URL. Beware that these files may indicate a new object squid currently intends to swap onto disk. If the file suddenly went away, or is removed when squid tries to fetch the object, it will complain bitterly. You must slow rebuild your cache, if you use this option.
sv: Bit#2 är reserverad för konstiga filer som inte ens innehåller en URL. Tänk på att dessa filer kan indikera ett nytt objekt som squid för närvarande avser att byta ut till disk. Om filen plötsligt försvinner eller tas bort när squid försöker hämta objektet, kommer det att klaga bittert. Du måste långsamt bygga om din cache om du använder den här flaggan.

source: It is recommended that if you dare to use bit#1 or bit#2, you should only grant the purge tool access to your squid, e.g. move the HTTP and ICP listening port of squid to a different non-standard location during the purge.
sv: Om du vågar använda bit#1 eller bit#2 rekommenderas att du endast ger rensningsverktyget åtkomst till din squid, t.ex. genom att flytta squids HTTP- och ICP-lyssningsport till en annan icke-standardplats under rensningen.

source: default: 0 (just print)
sv: standard: 0 (bara utskrift)

source: If you specify this switch, all commandline parameters will be shown after they were parsed.
sv: Om du anger denna switch visas alla kommandoradsparametrar efter att de har analyserats.

source: default: off
sv: standard: av

source: be verbose in the things reported about the file. See the output section below.
sv: vara utförlig i rapporteringen om filen. Se avsnittet om utdata nedan.

source: In order to use B<purge> to affect a running proxy with PURGE method, you will have to enable this feature in squid.conf. By default, PURGE is disabled. You should watch closely for whom you enable the PURGE ability, otherwise a total stranger just might wipe your cache content. Lines similar to the following will need to be added to your squid.conf:
sv: För att kunna använda B<purge> för att påverka en körande proxy med PURGE-metoden måste du aktivera denna funktion i squid.conf. Som standard är PURGE inaktiverat. Du bör vara noga med vem du aktiverar PURGE-funktionen för, annars kan en helt okänd person radera innehållet i din cache. Rader som liknar följande måste läggas till i din squid.conf:

source: Reconfigure or restart (preferred) your squid after changing the configuration file.
sv: Konfigurera om eller starta om (rekommenderas) din squid efter att du har ändrat konfigurationsfilen.

source: OUTPUT
sv: UTDATA

source: In regular mode, the output of purge consists of four columns. If the URL contains not encoded whitespaces, it may look as if there are more columns, but the last one is the URI.
sv: I normalt läge består utdata från purge av fyra kolumner. Om URL:en innehåller okodade blanktecken kan det se ut som om det finns fler kolumner, men den sista är URI:n.

source: # name meaning = ====== =========================================================== 1 file name of cache file eximed which matches the regular expression. 2 status return result of purge request, " 0" in print mode. 3 size object size including stored headers, not file size. 4 uri perceived uri
sv: # namn betydelse = ====== =========================================================== 1 file namn på cachefil eximed som matchar det reguljära uttrycket. 2 status returresultat av rensningsbegäran, " 0" i utskriftsläge. 3 storlek objektstorlek inklusive lagrade rubriker, inte filstorlek. 4 uri uppfattad uri

source: Example for non-verbose output in print-mode:
sv: Exempel på icke-detaljerad utdata i utskriftsläge:

source: In verbose mode, additional columns are inserted before the uri. Time stamps are reported using hexadecimal notation, and Squid's standard for reporting "no such timestamp" == -1, and "unparsable timestamp" == -2.
sv: I verboseläge infogas ytterligare kolumner före uri. Tidsstämplar rapporteras med hexadecimal notation, och Squids standard för rapportering av "ingen sådan tidsstämpel" == -1, och "otolkbar tidsstämpel" == -2.

source: # name meaning = ====== =========================================================== 1 file name of cache file eximed which matches the re. 2 status return result of purge request, " 0" in print mode "-P 0". 3 size object size including stored headers, not file size. 4 md5 MD5 of URI from file, or "(no_md5_data_available)" string. 5 ts UTC of Value of Date: header in hex notation 6 lr UTC of last time the object was referenced 7 ex UTC of Expires: header 8 lr UTC of Last-Modified: header 9 flags Value of objects flags field in hex, see: Programmers Guide 10 refcnt number of times the object was referenced. 11 uri STORE_META_URL uri or "strange_file"
sv: # namn betydelse = ====== =========================================================== 1 fil namn på cachefil som matchar re. 2 status returresultat av rensningsbegäran, " 0" i utskriftsläge "-P 0". 3 storlek objektstorlek inklusive lagrade rubriker, inte filstorlek. 4 md5 MD5 för URI från filen, eller strängen "(no_md5_data_available)". 5 ts UTC för värdet i Date: header i hexadecimal notation 6 lr UTC för senaste gången objektet refererades 7 ex UTC för Expires: header 8 lr UTC för Last-Modified: header 9 flags Värde för objektets flags-fält i hex, se: Programmers Guide 10 refcnt Antal gånger objektet refererades. 11 uri STORE_META_URL uri eller "strange_file"

source: Example for verbose output in print-mode:
sv: Exempel på detaljerad utdata i utskriftsläge:

source: Purge does not slow rebuild the cache for you.
sv: Tömning gör inte att cacheminnet byggs om långsammare.

source: It is still relatively slow, especially if your machine is low on memory and/or unable to hold all OS directory cache entries in main memory.
sv: Det är fortfarande relativt långsamt, särskilt om din dator har lite minne och/eller inte kan lagra alla cacheposter i operativsystemets katalog i huvudminnet.

source: Should never be used on "busy" caches with purge modes higher than 1.
sv: Bör aldrig användas på "upptagna" cacher med rensningslägen högre än 1.

source: TODO
sv: ATT GÖRA

source: 1) use the stat() result on weird files to have a look at their ctime and mtime. If they are younger than, lets say 30 seconds, they were just created by B<squid> and should not be removed.
sv: 1) Använd resultatet från stat() på konstiga filer för att titta på deras ctime och mtime. Om de är yngre än, säg 30 sekunder, har de just skapats av B<squid> och bör inte tas bort.

source: 2) Add a query before purging objects or removing files, and add another option to remove nagging for the experienced user.
sv: 2) Lägg till en fråga innan du rensar objekt eller tar bort filer, och lägg till en annan flagga för att ta bort påminnelser för erfarna användare.

source: 3) The reported object size may be off by one.
sv: 3) Den rapporterade objektstorleken kan avvika med ett.

source: This program and manual was written by
sv: Detta program och denna manual har skrivits av

source: Based on original squidpurge README.
sv: Baserat på original README för squidpurge.

source: squidclient - A simple HTTP web client tool
sv: squidclient – Ett enkelt HTTP-webbklientverktyg

source: string
sv: sträng

source: remote host
sv: fjärrvärd

source: Host header
sv: Host-rubrik

source: method
sv: metod

source: count
sv: antal

source: user
sv: användare

source: password
sv: lösenord

source: interval
sv: intervall

source: CA certificates file
sv: CA-certifikatfil

source: client X.509 certificate file
sv: klientens X.509-certifikatfil

source: TLS session parameters
sv: TLS-sessionparametrar

source: B<squidclient> is a tool providing a command line interface for retrieving URLs. Designed for testing any HTTP 0.9, 1.0, or 1.1 web server or proxy. This tool can be combined with scripts to perform any basic HTTP operation. Some additional features for access to the B<squid> proxy object cache and management information are provided.
sv: B<squidclient> är ett verktyg som tillhandahåller ett kommandoradsgränssnitt för att hämta URL:er. Utformat för att testa alla HTTP 0.9-, 1.0- eller 1.1-webbservrar eller proxyservrar. Detta verktyg kan kombineras med skript för att utföra alla grundläggande HTTP-åtgärder. Vissa ytterligare funktioner för åtkomst till B<squid> proxyobjektcache och hanteringsinformation tillhandahålls.

source: Do NOT include Accept: header.
sv: Inkludera INTE Accept:-header.
