Repository: squid-cache/squid
Catalog: doc/manuals/*.po
Languages: sv

source: As the password needs to be printed in plain text in your Squid configuration it is strongly recommended to use an account with minimal associated privileges. This to limit the damage in case someone could get hold of a copy of your Squid configuration file or extracts the password used from a process listing.
sv: Eftersom lösenordet måste skrivas ut i klartext i din Squid-konfiguration rekommenderas det starkt att använda ett konto med minimala behörigheter. Detta för att begränsa skadan om någon skulle få tag på en kopia av din Squid-konfigurationsfil eller extrahera lösenordet från en processlista.

source: LDAP server bind path.
sv: LDAP-serverns bindningsväg.

source: LDAP server URL in form ldap[s]://server:port
sv: LDAP-serveradress i formatet ldap[s]://server:port

source: list of ldap servers of the form lserver|lserver@|lserver@Realm[:lserver@|lserver@Realm]
sv: lista över ldap-servrar i formatet lserver|lserver@|lserver@Realm[:lserver@|lserver@Realm]

source: A list of group name per Kerberos domain of the form Group|Group@|Group@Realm[:Group@|Group@Realm]
sv: En lista över gruppnamn per Kerberos-domän i formatet Grupp|Grupp@|Grupp@Realm[:Grupp@|Grupp@Realm]

source: A list of group name per Kerberos domain of the form Group|Group@|Group@Realm[:Group@|Group@Realm] where group is in UTF-8 hex format
sv: En lista över gruppnamn per Kerberos-domän i formatet Grupp|Grupp@|Grupp@Realm[:Grupp@|Grupp@Realm], där gruppen är i UTF-8-hexformat

source: A list of group name per Kerberos domain of the form Group|Group@|Group@Realm[:Group@|Group@Realm] where group and domain is in UTF-8 hex format
sv: En lista över gruppnamn per Kerberos-domän i formatet Grupp|Grupp@|Grupp@Realm[:Grupp@|Grupp@Realm], där grupp och domän är i UTF-8-hexformat

source: This helper is intended to be used as an B<external_acl_type> helper in B<squid.conf.>
sv: Denna hjälpfunktion är avsedd att användas som en B<external_acl_type>-hjälpfunktion i B<squid.conf.>

source: B<NOTE:> The following squid startup file modification may be required:
sv: B<OBSERVERA:> Följande ändring av squids startfil kan behövas:

source: Add the following lines to the squid startup script to point squid to a keytab file which contains the HTTP/fqdn service principal for the default Kerberos domain. The fqdn must be the proxy name set in IE or firefox. You can not use an IP address.
sv: Lägg till följande rader i startskriptet för Squid för att peka Squid mot en keytab-fil som innehåller HTTP/fqdn-tjänstprincipalen för standarddomänen Kerberos. Fqdn måste vara det proxynamn som är inställt i IE eller Firefox. Du kan inte använda en IP-adress.

source: If you use a different Kerberos domain than the machine itself is in you can point squid to the separate Kerberos config file by setting the following environment variable in the startup script.
sv: Om du använder en annan Kerberos-domän än den som maskinen själv tillhör kan du peka Squid till den separata Kerberos-konfigurationsfilen genom att ställa in följande miljövariabel i startskriptet.

source: B<ext_kerberos_ldap_group_acl> will determine automagically the right ldap server. The following method is used:
sv: B<ext_kerberos_ldap_group_acl> kommer automatiskt att bestämma rätt ldap-server. Följande metod används:

source: 1) For user@REALM a) Query DNS for SRV record _ldap._tcp.REALM b) Query DNS for A record REALM c) Use LDAP_URL if given
sv: 1) För användare@REALM a) Fråga DNS om SRV-post _ldap._tcp.REALM b) Fråga DNS om A-post REALM c) Använd LDAP_URL om angivet

source: 2) For user a) Use domain -D REALM and follow step 1) b) Use LDAP_URL if given
sv: 2) För användare a) Använd domänen -D REALM och följ steg 1) b) Använd LDAP_URL om det anges

source: The Groups to check against are determined as follows:
sv: De grupper som ska kontrolleras fastställs enligt följande:

source: 1) For user@REALM a) Use values given by -g option which contain a @REALM e.g. -g GROUP1@REALM:GROUP2@REALM b) Use values given by -g option which contain a @ only e.g. -g GROUP1@:GROUP2@ c) Use values given by -g option which do not contain a realm e.g. -g GROUP1:GROUP2
sv: 1) För användare@REALM a) Använd värden som anges med flaggan -g och som innehåller @REALM, t.ex. -g GRUPP1@REALM:GRUPP2@REALM b) Använd värden som anges med flaggan -g och som endast innehåller @, t.ex. -g GRUPP1@:GRUPP2@ c) Använd värden som anges av flaggan -g som inte innehåller ett realm, t.ex. -g GRUPP1:GRUPP2

source: 2) For user a) Use values given by -g option which do not contain a realm e.g. -g GROUP1:GROUP2
sv: 2) För användare a) Använd värden som anges med flaggan -g som inte innehåller en realm, t.ex. -g GRUPP1:GRUPP2

source: 3) For NDOMAIN\euser a) Use realm given by -N NDOMAIN@REALM and then use values given by -g option which contain a @REALM e.g. -g GROUP1@REALM:GROUP2@REALM
sv: 3) För NDOMAIN\euser a) Använd realm som anges av -N NDOMAIN@REALM och använd sedan värden som anges av flaggan -g som innehåller ett @REALM, t.ex. -g GRUPP1@REALM:GRUPP2@REALM

source: To support Non-ASCII character use -t GROUP or -t GROUP@REALM instead of -g where GROUP is the hex UTF-8 representation e.g.
sv: För att stödja icke-ASCII-tecken, använd -t GROUP eller -t GROUP@REALM istället för -g, där GROUP är hexadecimal UTF-8-representation, t.ex.

source: -t 6d61726b7573 instead of -g markus
sv: -t 6d61726b7573 istället för -g markus

source: The REALM must still be based on the ASCII character set. If REALM contains also non ASCII characters use -T GROUP@REALM where GROUP and REALM are hex UTF-8 representation e.g.
sv: REALM måste fortfarande baseras på ASCII-teckensatsen. Om REALM även innehåller icke-ASCII-tecken, använd -T GROUP@REALM där GROUP och REALM är hexadecimala UTF-8-representationer, t.ex.

source: -T 6d61726b7573@57494e3230303352322e484f4d45 instead of -g markus@WIN2003R2.HOME
sv: -T 6d61726b7573@57494e3230303352322e484f4d45 istället för -gmarkus@WIN2003R2.HOME

source: For a translation of hex UTF-8 see for example http://www.utf8-chartable.de/unicode-utf8-table.pl
sv: För en översättning av hex UTF-8, se till exempel http://www.utf8-chartable.de/unicode-utf8-table.pl

source: The ldap server list can be: server - In this case server can be used for all Kerberos domains server@ - In this case server can be used for all Kerberos domains server@domain - In this case server can be used for Kerberos domain domain server1a@domain1:server1b@domain1:server2@domain2:server3@:server4 - A list is build with a colon as separator
sv: LDAP-serverlistan kan vara: server – I detta fall kan servern användas för alla Kerberos-domäner server@ – I detta fall kan servern användas för alla Kerberos-domäner server@domain – I detta fall kan servern användas för Kerberos-domänen domain server1a@domain1:server1b@domain1:server2@domain2:server3@:server4 – En lista skapas med kolon som separator

source: * Copyright (C) 1996-2015 The Squid Software Foundation and contributors * * Squid software is distributed under GPLv2+ license and includes * contributions from numerous individuals and organizations. * Please see the COPYING and CONTRIBUTORS files for details.
sv: * Copyright (C) 1996-2015 The Squid Software Foundation och bidragsgivare * * Squid-programvaran distribueras under GPLv2+-licens och innehåller * bidrag från ett stort antal individer och organisationer. * Se filerna COPYING och CONTRIBUTORS för mer information.

source: B<RFC1035> - Domain names - implementation and specification,
sv: B<RFC1035> - Domännamn - implementering och specifikation,

source: B<RFC2782> - A DNS RR for specifying the location of services (DNS SRV),
sv: B<RFC2782> - En DNS RR för att ange platsen för tjänster (DNS SRV),

source: B<RFC2254> - The String Representation of LDAP Search Filters,
sv: B<RFC2254> - Strängrepresentationen av LDAP-sökfilter,

source: B<RFC2307bis> - An Approach for Using LDAP as a Network Information Service http://www.padl.com/~lukeh/rfc2307bis.txt,"
sv: B<RFC2307bis> - En metod för att använda LDAP som nätverksinformationstjänst http://www.padl.com/~lukeh/rfc2307bis.txt,"

source: ext_ldap_group_acl - Squid LDAP external acl group helper
sv: ext_ldap_group_acl - Squid LDAP extern acl-grupphjälpare

source: base-DN
sv: bas-DN

source: options
sv: flaggor

source: B<ext_ldap_group_acl> allows Squid to connect to a LDAP directory to authorize users via LDAP groups. LDAP options are specified as parameters on the command line, while the username(s) and group(s) to be checked against the LDAP directory are specified on subsequent lines of input to the helper, one username/group pair per line separated by a space.
sv: B<ext_ldap_group_acl> gör det möjligt för Squid att ansluta till en LDAP-katalog för att auktorisera användare via LDAP-grupper. LDAP-flaggor anges som parametrar på kommandoraden, medan användarnamn och grupper som ska kontrolleras mot LDAP-katalogen anges på efterföljande rader i hjälpprogrammet, ett användarnamn/grupp-par per rad separerade med ett mellanslag.

source: As expected by the B<external_acl_type> construct of Squid, after specifying a username and group followed by a new line, this helper will produce either B<OK> or B<ERR> on the following line to show if the user is a member of the specified group.
sv: Som förväntat av Squids B<external_acl_type> -konstruktion kommer denna hjälpfunktion, efter att ett användarnamn och en grupp har angetts följt av en ny rad, att generera antingen B<OK> eller B<ERR> på följande rad för att visa om användaren är medlem i den angivna gruppen.

source: The program operates by searching with a search filter based on the users user name and requested group, and if a match is found it is determined that the user belongs to the group.
sv: Programmet fungerar genom att söka med ett sökfilter baserat på användarens användarnamn och begärd grupp, och om en matchning hittas fastställs det att användaren tillhör gruppen.

source: When to dereference aliases. Defaults to 'never'
sv: När alias ska avrefereras. Standardinställningen är "aldrig"

source: B<never> dereference aliases (default), B<always> dereference aliases, only during a B<search> or only to B<find> the base object
sv: B<never> dereference aliases (standard), B<always> dereference aliases, endast under en B<search> eller endast till B<find> basobjektet

source: B<REQUIRED.> Specifies the base DN under which the groups are located.
sv: B<OBLIGATORISKT.> Anger bas-DN under vilken grupperna finns.

source: Specifies the base DN under which the users are located (if different)
sv: Anger bas-DN under vilken användarna finns (om den skiljer sig)

source: Specify timeout used when connecting to LDAP servers (requires Netscape LDAP API libraries)
sv: Ange tidsgräns som används vid anslutning till LDAP-servrar (kräver Netscape LDAP API-bibliotek)

source: Debug mode where each step taken will get reported in detail. Useful for understanding what goes wrong if the result is not what was expected.
sv: Felsökningsläge där varje steg som tas rapporteras i detalj. Användbart för att förstå vad som går fel om resultatet inte blir som förväntat.

source: The DN and password to bind as while performing searches. Required if the LDAP directory does not allow anonymous searches.
sv: DN och lösenord som ska bindas vid sökningar. Krävs om LDAP-katalogen inte tillåter anonyma sökningar.

source: As the password needs to be printed in plain text in your Squid configuration and will be sent on the command line to the helper it is strongly recommended to use a account with minimal associated privileges. This to limit the damage in case someone could get hold of a copy of your Squid configuration file or extracts the password used from a process listing.
sv: Eftersom lösenordet måste skrivas ut i klartext i din Squid-konfiguration och kommer att skickas på kommandoraden till hjälpprogrammet rekommenderas det starkt att använda ett konto med minimala behörigheter. Detta för att begränsa skadan om någon skulle få tag på en kopia av din Squid-konfigurationsfil eller extrahera lösenordet från en processlista.

source: The DN and the name of a file containing the password to bind as while performing searches.
sv: DN och namnet på en fil som innehåller lösenordet som ska bindas vid sökningar.

source: Less insecure version of the former parameter pair with two advantages: The password does not occur in the process listing, and the password is not being compromised if someone gets the squid configuration file without getting the secretfile.
sv: Mindre osäker version av det tidigare parameterparet med två fördelar: Lösenordet visas inte i processlistan och lösenordet komprometteras inte om någon får tag på squid-konfigurationsfilen utan att få tag på secretfile.

source: Enable LDAP over SSL (requires Netscape LDAP API libraries)
sv: Aktivera LDAP över SSL (kräver Netscape LDAP API-bibliotek)

source: LDAP search filter used to search the LDAP directory for any matching group memberships. In the filter B<%u> will be replaced by the user name (or DN if the B<-F> or B<-u> options are used) and B<%g> by the requested group name.
sv: LDAP-sökfilter som används för att söka efter matchande gruppmedlemskap i LDAP-katalogen. I filtret ersätts B<%u> med användarnamnet (eller DN om flaggorna B<-F> eller B<-u> används) och B<%g> med det begärda gruppnamnet.

source: LDAP search filter used to search the LDAP directory for any matching users. In the filter B<%s> will be replaced by the user name. If B<%> is to be included literally in the filter then use B<%%>
sv: LDAP-sökfilter som används för att söka efter matchande användare i LDAP-katalogen. I filtret ersätts B<%s> med användarnamnet. Om B<%> ska inkluderas bokstavligt i filtret, använd B<%%>

source: Specifies that the first query argument sent to the helper by Squid is a extension to the basedn and will be temporarily added in front of the global basedn for this query.
sv: Anger att det första frågeargumentet som skickas till hjälpprogrammet av Squid är en förlängning av bas-DN och kommer att läggas tillfälligt framför den globala bas-DN för denna fråga.

source: Specify the LDAP server to connect to
sv: Ange LDAP-servern som du vill ansluta till

source: Specify the LDAP server to connect to by a LDAP URI (requires OpenLDAP libraries)
sv: Ange LDAP-servern som ska anslutas till med en LDAP-URI (kräver OpenLDAP-bibliotek)

source: Strip Kerberos Realm component from user names (@ separated)
sv: Ta bort Kerberos Realm-komponenten från användarnamn (separerade med @)

source: Specify an alternate TCP port where the LDAP server is listening if other than the default LDAP port 389.
sv: Ange en alternativ TCP-port där LDAP-servern lyssnar om den inte är standardporten 389.

source: Use a persistent LDAP connection. Normally the LDAP connection is only open while verifying a users group membership to preserve resources at the LDAP server. This option causes the LDAP connection to be kept open, allowing it to be reused for further user validations. Recommended for larger installations.
sv: Använd en permanent LDAP-anslutning. Normalt är LDAP-anslutningen endast öppen medan användarens gruppmedlemskap verifieras för att spara resurser på LDAP-servern. Den här flaggan gör att LDAP-anslutningen hålls öppen, så att den kan återanvändas för ytterligare användarvalideringar. Rekommenderas för större installationer.

source: Do not follow referrals
sv: Följ inte hänvisningar

source: Strip NT domain name component from user names (/ or \e separated)
sv: Ta bort NT-domännamnskomponenten från användarnamn (separerade med / eller \e)

source: Specify time limit on LDAP search operations
sv: Ange tidsgräns för LDAP-sökningar

source: LDAP attribute used to construct the user DN from the user name and base dn without needing to search for the user. A maximum of 16 occurrences of B<%s> are supported.
sv: LDAP-attribut som används för att konstruera användarens DN från användarnamnet och bas-dn utan att behöva söka efter användaren. Maximalt 16 förekomster av B<%s> stöds.

source: LDAP protocol version. Defaults to B<3> if not specified.
sv: LDAP-protokollversion. Standardinställningen är B<3> om inget annat anges.

source: Use TLS encryption
sv: Använd TLS-kryptering

source: This helper is intended to be used as an B<external_acl_type> helper in B<squid.conf .>
sv: Denna hjälpfunktion är avsedd att användas som en B<external_acl_type>-hjälpfunktion i B<squid.conf .>

source: B<NOTE:> When constructing search filters it is recommended to first test the filter using B<ldapsearch> to verify that the filter matches what you expect before you attempt to use B<ext_ldap_group_acl>
sv: B<OBSERVERA:> När du skapar sökfilter rekommenderas det att du först testar filtret med B<ldapsearch> för att kontrollera att filtret fungerar som förväntat innan du försöker använda B<ext_ldap_group_acl>

source: Based on prior work in B<squid_ldap_auth> by
sv: Baserat på tidigare arbete i B<squid_ldap_auth> av

source: Or contact your favorite LDAP list/friend if the question is more related to LDAP than Squid.
sv: Eller kontakta din favorit-LDAP-lista/vän om frågan är mer relaterad till LDAP än Squid.

source: Your favorite LDAP documentation
sv: Din favoritdokumentation om LDAP

source: ext_lm_group_acl - Squid external ACL helper to check Windows users group membership.
sv: ext_lm_group_acl – Squids externa ACL-hjälpmedel för att kontrollera Windows-användares gruppmedlemskap.

source: B<ext_lm_group_acl> is an installed binary in Squid for Windows builds.
sv: B<ext_lm_group_acl> är en installerad binärfil i Squid för Windows-versioner.

source: This helper must be used in with an authentication scheme (typically Basic or NTLM) based on Windows NT/2000 domain users (LM mode).
sv: Denna hjälpfunktion måste användas med ett autentiseringsschema (vanligtvis Basic eller NTLM) baserat på Windows NT/2000-domänanvändare (LM-läge).

source: Use case insensitive compare.
sv: Använd jämförelse utan hänsyn till versaler och gemener.

source: Specify the default user's domain.
sv: Ange standardanvändarens domän.

source: Start helper in Domain Global Group mode.
sv: Starta hjälpfunktionen i Domain Global Group-läge.

source: Use ONLY PDCs for group validation.
sv: Använd ENDAST PDC för gruppvalidering.

source: In the previous example all validated NT users member of GProxyUsers Global domain group or member of LProxyUsers machine local group are allowed to use the cache.
sv: I föregående exempel får alla validerade NT-användare som är medlemmar i den globala domängruppen GProxyUsers eller medlemmar i den lokala maskinkonfigurationsgruppen LProxyUsers använda cachen.

source: Groups with spaces in name, for example B<Domain Users> , must be quoted and the acl data ( B<Domain Users> ) must be placed into a separate file included by specifying B</path/to/file>
sv: Grupper med mellanslag i namnet, till exempel B<Domänanvändare>, måste anges inom citationstecken och acl-data ( B<Domänanvändare> ) måste placeras i en separat fil som inkluderas genom att ange B</path/to/file>

source: The previous example will be:
sv: Det föregående exemplet blir:

source: The B<DomainUsers.txt> file will contain only the following line:
sv: Filen B<DomainUsers.txt> kommer endast att innehålla följande rad:

source: B<Domain Users>
sv: B<Domänanvändare>

source: B<NOTE:> The standard group name comparison is case sensitive, so group name must be specified with same case as in the NT/2000 Domain. It's possible to enable case insensitive group name comparison ( B<-c> ), but on some not-english locales, the results can be unexpected.
sv: B<OBSERVERA:> Standardjämförelsen av gruppnamn är skiftlägeskänslig, så gruppnamnet måste anges med samma skiftläge som i NT/2000-domänen. Det är möjligt att aktivera skiftlägesokänslig jämförelse av gruppnamn ( B<-c> ), men i vissa icke-engelska lokaliseringar kan resultaten bli oväntade.

source: B<NOTE:> Native WIN32 NTLM and Basic Helpers must be used without the B<-A> and B<-D> switches.
sv: B<OBSERVERA:> Native WIN32 NTLM och Basic Helpers måste användas utan växlarna B<-A> och B<-D>.

source: Refer to Squid documentation for the more details on squid.conf.
sv: Se Squid-dokumentationen för mer information om squid.conf.

source: I strongly recommend that B<ext_lm_group_acl> is tested prior to being used in a production environment. It may behave differently on different platforms.
sv: Jag rekommenderar starkt att B<ext_lm_group_acl> testas innan det används i en produktionsmiljö. Det kan fungera olika på olika plattformar.

source: with contributions by
sv: med bidrag från

source: Based in part on prior work in B<check_group> by
sv: Baserat delvis på tidigare arbete i B<check_group> av

source: ext_session_acl - Squid session tracking external acl helper.
sv: ext_session_acl – Squid-sessionens spårning av extern ACL-hjälp.

source: database
sv: databas

source: B<ext_session_acl> maintains a concept of sessions by monitoring requests and timing out sessions. The timeout is based either on idle use ( B<-t> ) or a fixed period of time ( B<-T> ). The former is suitable for displaying terms and conditions to a user; the latter is suitable for the display of advertisements or other notices (both as a splash page - see config examples in the wiki online). The session helper can also be used to force users to re-authenticate if the B<%LOGIN> and B<-a> are both used.
sv: B<ext_session_acl> upprätthåller ett sessionskoncept genom att övervaka förfrågningar och tidsbegränsa sessioner. Tidsbegränsningen baseras antingen på inaktiv användning ( B<-t> ) eller en fast tidsperiod ( B<-T> ). Det förstnämnda är lämpligt för att visa villkor för en användare; det senare är lämpligt för visning av annonser eller andra meddelanden (båda som en startsida – se konfigurationsexempel i wiki online). Session helper kan också användas för att tvinga användare att autentisera sig på nytt om både B<%LOGIN> och B<-a> används.

source: Idle timeout for any session. The default if not specified (set to 3600 seconds).
sv: Idle timeout för alla sessioner. Standardinställningen om inget annat anges (inställd på 3600 sekunder).

source: Fixed timeout for any session. This will end the session after the timeout regardless of a user's activity. If used with B<active> mode, this will terminate the user's session after B<timeout> , after which another B<LOGIN> will be required. B<LOGOUT> will reset the session and timeout.
sv: Fast tidsgräns för alla sessioner. Detta avslutar sessionen efter tidsgränsen oavsett användarens aktivitet. Om detta används tillsammans med B<active> -läget avslutas användarens session efter B<tidsgräns>, varefter ytterligare en B<LOGIN> krävs. B<LOGOUT> återställer sessionen och tidsgränsen.
