Repository: squid-cache/squid
Catalog: errors/*.po
Languages: ja, sv

source: %E (TLS code: %x)
sv: %E (TLS-kod: %x)

source: <a href="../">Parent Directory</a> (<a href="/">Root Directory</a>)
ja: <a href="../">親のディレクトリ</a> (<a href="/">ルート・ディレクトリ</a>)
sv: <a href="../">Överordnad katalog</a> (<a href="/">rotkatalog</a>)

source: <b>Invalid Request</b> error was encountered while trying to process the request:
ja: <b>不正なリクエスト</b>のエラーが以下のリクエストを処理しようとしている間に発生しました:
sv: <b>Ogiltig begäran</b> fel uppstod vid försök att bearbeta begäran:

source: <b>Invalid Response</b> error was encountered while trying to process the request:
ja: <b>不正なリクエスト</b>のエラーが以下のリクエストを処理しようとしている間に発生しました:
sv: <b>Ogiltigt svarsfel</b> uppstod vid försök att bearbeta begäran:

source: A Timeout occurred while waiting to read data from the network. The network or server may be down or congested. Please retry your request.
sv: En tidsgräns överstegs medan du väntade på att läsa data från nätverket. Nätverket eller servern kan vara nere eller överbelastad. Försök igen.

source: A URL for the requested URN could not be retrieved
ja: リクエストされたURNのURLを調べられませんでした。
sv: En URL för begärd URN kunde inte hämtas

source: A non-recoverable internal failure or configuration problem prevents this request from being completed.
sv: Ett icke-återhämtningsbart internt fel eller konfigurationsproblem förhindrar att denna begäran kan slutföras.

source: Access Denied.
ja: アクセスを拒否されました。
sv: Åtkomst nekad.

source: Access control configuration prevents your request from being allowed at this time. Please contact your service provider if you feel this is incorrect.
sv: Konfigurationen av åtkomstkontrollen förhindrar att din begäran tillåts just nu. Kontakta din tjänsteleverantör om du anser att detta är felaktigt.

source: All configured parent caches may be currently unreachable.
sv: Alla konfigurerade överordnade cachar kan för närvarande vara oåtkomliga.

source: An FTP authentication failure occurred while trying to retrieve the URL: <a href="%U">%U</a>
ja: FTP認証の失敗が、以下のURLから情報を得ようとしている間に発生しました: <a href="%U">%U</a>
sv: Ett FTP-autentiseringsfel inträffade när URL:en försökte hämtas: <a href="%U">%U</a>

source: An FTP protocol error occurred while trying to retrieve the URL: <a href="%U">%U</a>
ja: FTPのプロトコル・エラーが、以下のURLから情報を得ようとしている間に発生しました: <a href="%U">%U</a>
sv: Ett FTP-protokollfel uppstod när URL:en försökte hämtas: <a href="%U">%U</a>

source: An Illegal response was received from the ICAP server.
ja: ICAPサーバから不正な応答がありました。
sv: Ett felaktigt svar mottogs från ICAP-servern.

source: An Internet connection needed to access this domains origin servers may be down.
sv: Internetanslutningen som krävs för att komma åt domänens ursprungliga servrar kan vara nere.

source: An error condition occurred while reading data from the network. Please retry your request.
sv: Ett fel uppstod vid läsning av data från nätverket. Försök igen.

source: An error condition occurred while writing to the network. Please retry your request.
sv: Ett fel uppstod vid skrivning till nätverket. Försök igen.

source: Application verification failure
sv: Fel vid verifiering av applikation

source: At least one precondition specified by the HTTP client in the request header has failed.
sv: Minst en förutsättning som anges av HTTP-klienten i förfrågningsrubriken har misslyckats.

source: Authority and issuer serial number mismatch
sv: Utfärdaren och utfärdarens serienummer stämmer inte överens

source: Authority and subject key identifier mismatch
sv: Utfärdaren och ämnesnyckelidentifierare stämmer inte överens

source: CRL has expired
sv: CRL har gått ut

source: CRL is not yet valid
sv: CRL är ännu inte giltig

source: CRL path validation error
sv: Valideringsfel i CRL-sökväg

source: CRL signature failure
sv: Fel i CRL-signatur

source: Cannot Resolve URN
ja: URN の解決ができませんでした。
sv: Kan inte slå upp URN

source: Cert validation infinite loop detected
sv: Oändlig slinga upptäcktes vid certifikatvalidering

source: Certificate chain too long
sv: Certifikatkedjan är för lång

source: Certificate does not match domainname
sv: Certifikatet stämmer inte överens med domännamnet

source: Certificate has expired
sv: Certifikatet har gått ut

source: Certificate is not yet valid
sv: Certifikatet är ännu inte giltigt

source: Certificate not trusted
sv: Certifikatet är inte betrott

source: Certificate rejected
sv: Certifikatet avvisat

source: Certificate revoked
sv: Certifikatet är återkallat

source: Certificate signature failure
sv: Certifikatets signatur misslyckades

source: Connection Lifetime Expired
ja: 接続の存続時間が終了しました。
sv: Anslutningens livslängd har gått ut

source: Connection to %I failed.
ja: %I への接続に失敗しました。
sv: Anslutningen till %I misslyckades.

source: Content-Length missing for POST or PUT requests.
ja: POSTまたはPUTのリクエストにContent-Lengthヘッダがありません。
sv: Content-Length saknas för POST- eller PUT-förfrågningar.

source: Different CRL scope
sv: Olika CRL-omfattning

source: Directory Content:
ja: ディレクトリの内容:
sv: Kataloginnehåll:

source: Directory Listing
sv: Kataloglistning

source: Directory: %U
sv: Katalog: %U

source: Directory: <a href="%U">%U</a>/
sv: Katalog: <a href="%U">%U/</a>

source: ERROR
ja: エラー
sv: FEL

source: ERROR: Cache Access Denied
ja: エラー: キャッシュにアクセスを拒否されました。
sv: FEL: Cacheåtkomst nekad

source: ERROR: Cache Manager Access Denied
ja: エラー: キャッシュ・マネージャにアクセスを拒否されました。
sv: FEL: Åtkomst till cachehanteraren nekad

source: ERROR: FTP upload failed
ja: エラー: FTP アップロードは失敗しました
sv: FEL: FTP-uppladdning misslyckades

source: ERROR: The requested URL could not be retrieved
ja: エラー: 要求されたURLからデータを取り出せませんでした。
sv: FEL: Den begärda URL-adressen kunde inte hämtas

source: ERROR: The requested URN could not be retrieved
sv: FEL: Begärd URN kunde inte hämtas

source: ESI Processing failed.
ja: ESIの処理に失敗しました。
sv: ESI-bearbetningen misslyckades.

source: FTP PUT Successful.
sv: FTP PUT lyckades.

source: FTP PUT upload failed
sv: FTP PUT-uppladdning misslyckades

source: FTP is Disabled
ja: FTPは無効です。
sv: FTP är inaktiverat

source: Failed to establish a secure connection to %I
ja: %Iへの安全な接続を確立に失敗しました。
sv: Misslyckades med att etablera en säker anslutning till %I

source: File created
ja: ファイルを作成しました。
sv: Filen skapad

source: File updated
ja: ファイルを更新しました。
sv: Filen uppdaterad

source: Format error in CRL's lastUpdate field
sv: Formatfel i CRL:ens lastUpdate-fält

source: Format error in CRL's nextUpdate field
sv: Formatfel i CRL:ens nextUpdate-fält

source: Format error in certificate's notAfter field
sv: Formatfel i certifikatets notAfter-fält

source: Format error in certificate's notBefore field
sv: Formatfel i certifikatets notBefore-fält

source: Forwarding Denied.
ja: 転送は拒否されました。
sv: Vidarebefordran nekad.

source: Gateway Proxy Failure
sv: Gateway-proxyfel

source: Generated %T by %h (%s)
ja: %Tに%h (%s)が生成しました。
sv: Genererades %T av %h (%s)

source: HTTP/1.1 <q>Expect:</q> feature is being asked from an HTTP/1.0 software.
sv: HTTP/1.1 <q>Expect:</q>-funktionen begärs från en HTTP/1.0-programvara.

source: Hey, don't expect too much from URNs on %T :)
ja: やあ、%Tの時点でURNには多くを期待しないでください。:)
sv: Hallå, förvänta dig inte för mycket av URN:er på %T :)

source: How to find these settings in your browser:
sv: Så här hittar du dessa inställningar i din webbläsare:

source: ICAP protocol error.
ja: ICAPのプロトコル・エラーです。
sv: ICAP-protokollfel.

source: If you are making a GET request, then the item you are trying to download is too large.
ja: GETの要求をしていたなら、ダウンロードしようとしていた対象が大きすぎます。
sv: Om du gör en GET-begäran är det objekt du försöker ladda ner för stort.

source: If you are making a POST or PUT request, then the item you are trying to upload is too large.
ja: POSTまたはPUTの要求をしていたなら、アップロードしていた対象が大きすぎます。
sv: Om du gör en POST- eller PUT-begäran är objektet du försöker ladda upp för stort.

source: Illegal character in hostname; underscores are not allowed.
ja: ホスト名に不正な文字が使われています: アンダースコアは使えません。
sv: Ogiltigt tecken i värdnamn; understreck är inte tillåtna.

source: Illegal double-escape in the URL-Path
ja: 不正な二重のエスケープがURLパスにあります。
sv: Ogiltigt dubbel-escape i URL-Path

source: Invalid CA certificate
sv: Ogiltigt CA-certifikat

source: Invalid URL
ja: 不正なURL
sv: Ogiltig URL

source: Key usage does not include certificate signing
sv: Nyckelanvändningen omfattar inte certifikatsignering

source: Missing HTTP Identifier (HTTP/1.0).
ja: HTTPの識別子(HTTP/1.0)がありません。
sv: Saknar HTTP-identifierare (HTTP/1.0).

source: Missing URL.
ja: URLがありません。
sv: Saknar URL.

source: Missing hostname
ja: ホスト名がありません。
sv: Saknar värdnamn

source: Missing or incorrect access protocol (should be <q>http://</q> or similar)
ja: (<q>http://</q>または同類の)アクセス・プロトコルが抜けているか不正です。
sv: Saknar eller felaktigt åtkomstprotokoll (bör vara <q>http://</q> eller liknande)

source: Missing or unknown request method.
ja: 要求の方法が抜けているか不明です。
sv: Saknar eller okänd förfrågningsmetod.

source: No Wais Relay
ja: Waisの中継先が指定されていません。
sv: Inget Wais-relä

source: Operation successful
ja: 操作に成功
sv: Åtgärden lyckades

source: Out of memory
sv: Slut på minne

source: Path length constraint exceeded
sv: Begränsning för sökvägens längd överstegs

source: Please contact the <a href="mailto:%w%W">cache administrator</a> if you have difficulties authenticating yourself or, if you <em>are</em> the administrator, read Squid documentation on cache manager interface and check cache log for more detailed error messages.
ja: あなた自身の認証が困難な場合は、<a href="mailto:%w%W">キャッシュの管理者</a>に連絡してください。または、あなた<em>自身</em>が管理者なら、キャッシュマネージャ・インターフェイスのSquidの文書を読んで、キャッシュのログにある詳細なエラーメッセージを確認してください。
sv: Kontakta <a href="mailto:%w%W">cacheadministratören</a> om du har problem med att autentisera dig själv eller, om du <em>är</em> administratör, läs Squid-dokumentationen om cachehanteringsgränssnittet och kontrollera cache-loggen för mer detaljerade felmeddelanden.

source: Please contact the <a href="mailto:%w%W">cache administrator</a> if you have difficulties authenticating yourself.
sv: Kontakta <a href="mailto:%w%W">cacheadministratören</a> om du har problem med att autentisera dig.

source: Precondition Failed.
sv: Förutsättning misslyckades.

source: RFC 3779 resource not subset of parent's resources
sv: RFC 3779-resursen är inte en del av överordnade resurser

source: Read Error
ja: 読み込みエラー
sv: Läsfel

source: Read Timeout
ja: 読み込みタイムアウト
sv: Tidsgräns överstegs vid läsning

source: Request is too large.
ja: リクエストが長すぎます。
sv: Begäran är för stor.

source: SSL Certificate expired on: %ssl_notafter
sv: SSL-certifikatet gick ut: %ssl_notafter

source: SSL Certificate has invalid expiration date (the 'not after' field): %ssl_subject
sv: SSL-certifikatet har ett ogiltigt utgångsdatum (fältet "inte efter"): %ssl_subject

source: SSL Certificate has invalid start date (the 'not before' field): %ssl_subject
sv: SSL-certifikatet har ogiltigt startdatum (fältet "inte före"): %ssl_subject

source: Select Auto-detect proxy settings for this network
sv: Välj Automatisk identifiering av proxyinställningar för detta nätverk

source: Select Automatically detect settings
sv: Välj inställningar för Automatisk identifiering

source: Select Use Automatic proxy configuration
sv: Välj Använd automatisk proxykonfiguration

source: Self signed certificate
sv: Självsignerat certifikat

source: Self signed certificate in certificate chain
sv: Självsignerat certifikat i certifikatkedjan

source: Self-signed SSL Certificate in chain: %ssl_subject
sv: Självsignerat SSL-certifikat i kedjan: %ssl_subject

source: Self-signed SSL Certificate: %ssl_subject
sv: Självsignerat SSL-certifikat: %ssl_subject

source: Socket Failure
ja: ソケット作成に失敗
sv: Uttagsfel

source: Some aspect of the requested URL is incorrect.
ja: リクエストされたURLに不正な部分があります。
sv: Något i den begärda URL-adressen är felaktig.

source: Some possible problems are:
ja: ありそうな問題:
sv: Några möjliga problem är:

source: Sorry, you are not currently allowed to request %U from this cache manager until you have authenticated yourself.
ja: 申し訳ありませんが、あなた自身の認証を済ませるまで、このキャッシュマネージャに %U をリクエストすることは現在許可されていません。
sv: Tyvärr, du har för närvarande inte behörighet att begära %U från denna cachehanterare förrän du har autentiserat dig.

source: Sorry, you are not currently allowed to request %U from this cache until you have authenticated yourself.
ja: 申し訳ありませんが、あなた自身の認証を済ませるまで、このキャッシュに %U をリクエストすることは現在許可されていません。
sv: Tyvärr, du har för närvarande inte behörighet att begära %U från denna cache förrän du har autentiserat dig.

source: Squid did not receive any data for this request.
ja: このリクエストにに対してSquidは何もデータを受け取りませんでした。
sv: Squid tog inte emot någon data för denna begäran.

source: Squid does not support some access protocols. For example, the SSH protocol is currently not supported.
sv: Squid har inte stöd för vissa åtkomstprotokoll. Till exempel stöds för närvarande inte SSH-protokollet.

source: Squid has terminated the request because it has exceeded the maximum connection lifetime.
ja: 最大の接続有効時間が過ぎたため、Squidはリクエストを終了しました。
sv: Squid har avslutat begäran eftersom den har överskred den maximala livstiden för anslutningar.

source: Squid is unable to create a TCP socket, presumably due to excessive load. Please retry your request.
ja: おそらく過大な負荷のため、SquidはTCPソケットを作成できませんでした。再度リクエストしてください。
sv: Squid kan inte skapa ett TCP-uttag, troligen på grund av överbelastning. Försök igen.

source: Squid sent the following FTP command:
ja: Squidは以下のFTPコマンドを送りました:
sv: Squid skickade följande FTP-kommando:

source: Subject issuer mismatch
sv: Ämnesutfärdaren stämmer inte

source: The DNS server returned:
ja: DNSサーバの応答:
sv: DNS-servern returnerade:

source: The ESI processor returned:
sv: ESI-processorn returnerade:

source: The FTP server was too busy to retrieve the URL: <a href="%U">%U</a>
ja: 以下のURLを取得しようとしているとき、FTPサーバの負荷が高すぎました: <a href="%U">%U</a>
sv: FTP-servern var för upptagen för att hämta denna URL: <a href="%U">%U</a>

source: The HTTP Response message received from the contacted server could not be understood or was otherwise malformed. Please contact the site operator.
sv: HTTP-svarsmeddelandet som mottogs från den kontaktade servern kunde inte förstås eller var på annat sätt felaktigt. Kontakta webbplatsoperatören.

source: The ICAP server is not reachable.
ja: ICAPサーバに到達到達できません。
sv: ICAP-servern är inte nåbar.

source: The administrator may not allow this cache to make direct connections to origin servers.
sv: Administratören får inte tillåta att denna cache gör direkta anslutningar till ursprungliga servrar.

source: The domain may have moved very recently. Trying again will resolve that.
sv: Domänen kan ha flyttats nyligen. Försök igen så löser sig problemet.

source: The following URL could not be retrieved: <a href="%U">%U</a>
ja: 以下のURLを取得できませんでした: <a href="%U">%U</a>
sv: Följande URL kunde inte hämtas: <a href="%U">%U</a>

source: The following error was encountered while trying to retrieve the URL: <a href="%U">%U</a>
sv: Följande fel uppstod vid försöket att hämta URL:en: <a href="%U">%U</a>

source: The following error was encountered while trying to retrieve the URN: <a href="%U">%U</a>
sv: Följande fel uppstod vid försöket att hämta denna URN: <a href="%U">%U</a>

source: The remote host or network may be down. Please try the request again.
sv: Den fjärranslutna värden eller nätverket kan vara nere. Försök igen.

source: The request or reply is too large.
ja: リクエストまたはリプライが大きすぎます。
sv: Begäran eller svaret är för stort.

source: The requested URL could not be retrieved
ja: リクエストされた URL は取得できませんでした
sv: Begärd URL kunde inte hämtas

source: The server responded with:
sv: Servern svarade med:

source: The system returned:
sv: Systemet returnerade:

source: The system returned: <i>%E</i>
ja: システムが以下のエラーを返しました: <i>%E</i>
sv: Systemet returnerade: <i>%E</i>

source: The website may require you to use a local country-based version. Using your ISP provided DNS server(s) should resolve that.
sv: Webbplatsen kan kräva att du använder en lokal landsbaserad version. Problemet kan lösas om du använder DNS-servrar som tillhandahålls av din internetleverantör.

source: There is no WAIS Relay host defined for this Cache! Yell at the administrator.
sv: Det finns ingen WAIS-relävärd definierad för denna cache! Skäll på administratören.

source: These limits have been established by the Internet Service Provider who operates this cache. Please contact them directly if you feel this is an error.
sv: Dessa begränsningar har fastställts av den internetleverantör som driver denna cache. Kontakta dem direkt om du anser att detta är ett fel.

source: This Squid does not accept the HTTP version you are attempting to use.
sv: Denna Squid accepterar inte den HTTP-version du försöker använda.

source: This cache does not support FTP.
ja: キャッシュは FTP をサポートしていません．
sv: Denna cache saknar stöd för FTP.

source: This cache is in the process of shutting down and can not service your request at this time. Please retry your request again soon.
sv: Denna cache är på väg att stängas ner och kan inte hantera din begäran just nu. Försök igen snart.

source: This cache will not forward your request because it is trying to enforce a sibling relationship. Perhaps the client at %i is a cache which has been misconfigured.
sv: Denna cache vidarebefordrar inte din begäran eftersom den försöker upprätthålla ett syskonförhållande. Kanske är klienten på %i en cache som har konfigurerats felaktigt.

source: This may be due to limits established by the Internet Service Provider who operates this cache. Please contact them directly for more information.
sv: Detta kan bero på begränsningar som fastställts av den internetleverantör som driver denna cache. Kontakta dem direkt för mer information.

source: This means that some aspect of the ICAP communication failed.
sv: Det betyder att någon del av ICAP-kommunikationen misslyckades.

source: This means that the FTP server may not have permission or space to store the file. Check the path, permissions, diskspace and try again.
sv: Det betyder att FTP-servern kanske inte har behörighet eller utrymme att lagra filen. Kontrollera sökvägen, behörigheter och diskutrymmet och försök igen.

source: This means that the cache was not able to resolve the hostname presented in the URL. Check if the address is correct.
sv: Det betyder att cachen inte kunde slå upp värdnamnet som anges i URL:en. Kontrollera att adressen är korrekt.

source: This means that the surrogate was not able to process the ESI template. Please report this error to the webmaster.
sv: Det betyder att surrogaten inte kunde bearbeta ESI-mallen. Rapportera detta fel till webbansvarig.

source: This means the domain name you are trying to access apparently no longer exists on the machine you are requesting it from.
sv: Det betyder att domännamnet du försöker komma åt uppenbarligen inte längre finns på den maskin du begär det från.

source: This means:
sv: Det betyder:

source: This might be caused by an FTP URL with an absolute path (which does not comply with RFC 1738). If this is the cause, then the file can be found at <a href="%B">%B</a>.
sv: Detta kan orsakas av en FTP-URL med en absolut sökväg (som inte överensstämmer med RFC 1738). Om detta är orsaken kan filen hittas på <a href="%B">%B</a>.

source: This proxy and the remote host failed to negotiate a mutually acceptable security settings for handling your request. It is possible that the remote host does not support secure connections, or the proxy is not satisfied with the host security credentials.
sv: Denna proxy och fjärrvärden kunde inte komma överens om gemensamma säkerhetsinställningar för att hantera din begäran. Det är möjligt att fjärrvärden inte har stöd för säkra anslutningar eller att proxyn inte godkänner värdens säkerhetsuppgifter.

source: This proxy limits your time online with a quota. Your time budget is now empty but will be refilled when the configured time period starts again.
sv: Denna proxy begränsar din tid på nätet med en kvot. Din tidskvot är nu tom men kommer att fyllas på igen när den konfigurerade tidsperioden börjar om.

source: This request could not be forwarded to the origin server or to any parent caches.
sv: Denna begäran kunde inte vidarebefordras till ursprungsservern eller till någon överordnad cache.

source: Time Quota Exceeded.
sv: Tidsgränsen överskreds.

source: Tools -&gt; Internet Options -&gt; Connection -&gt; LAN Settings -&gt;Proxy
sv: Verktyg -&gt; Internetalternativ -&gt; Anslutning -&gt; LAN-inställningar -&gt;Proxy

source: Tools -&gt; Options -&gt; Advanced -&gt; Network -&gt; Connection Settings
sv: Verktyg -&gt; Alternativ -&gt; Avancerat -&gt; Nätverk -&gt; Anslutningsinställningar

source: Tools -&gt; Preferences -&gt; Advanced -&gt; Network -&gt; Proxy Servers
sv: Verktyg -&gt; Inställningar -&gt; Avancerat -&gt; Nätverk -&gt; Proxyservrar

source: URI Host Conflict
sv: URI-värdkonflikt

source: Unable to decode issuer (CA) public key: %ssl_ca_name
sv: Det går inte att avkoda utfärdarens (CA) publika nyckel: %ssl_ca_name

source: Unable to decode issuer public key
sv: Det går inte att avkoda utfärdarens publika nyckel

source: Unable to decrypt CRL's signature
sv: Det går inte att avkryptera signaturen för denna CRL

source: Unable to decrypt certificate's signature
sv: Det går inte att avkryptera certifikatets signatur

source: Unable to determine IP address from host name <q>%H</q>
ja: 以下のホスト名の IP address を調べられません．<q>%H</q>
sv: Det går inte att fastställa IP-adressen från värdnamnet <q>%H</q>

source: Unable to forward this request at this time.
ja: 現在，リクエストの転送はできません．
sv: Det går inte att vidarebefordra denna begäran just nu.

source: Unable to get certificate CRL
sv: Det går inte att hämta certifikatets CRL

source: Unable to get issuer certificate
sv: Det går inte att hämta utfärdarens certifikat

source: Unable to get local issuer certificate
sv: Det går inte att hämta lokalt utfärdarcertifikat

source: Unable to verify the first certificate
sv: Det går inte att verifiera det första certifikatet

source: Unsupported Protocol
sv: Protokollet stöds inte

source: Unsupported Request Method and Protocol
ja: サポートされていないリクエスト/プロトコルです．
sv: Förfrågningsmetod och protokoll stöds inte

source: Unsupported certificate purpose
sv: Certifikatets syfte stöds inte

source: Unsupported extension feature
sv: Utökningsfunktionen stöds inte

source: Valid document was not found in the cache and <q>only-if-cached</q> directive was specified.
ja: <q>only-if-cached</q> の指定がありましたが，その文書がキャッシュに存在していません．
sv: Giltigt dokument hittades inte i cachen och direktivet <q>only-if-cached</q> angavs.

source: Web Browser Configuration
sv: Webbläsarkonfiguration

source: Write Error
ja: 送信処理中にエラーが発生しました．
sv: Skrivfel

source: You have issued a request with a <q>only-if-cached</q> cache control directive. The document was not found in the cache, <em>or</em> it required revalidation prohibited by the <q>only-if-cached</q> directive.
ja: キャッシュへの <q>only-if-cached</q> つきリクエストがありましたが，この文書はキャッシュに存在していないか，<em>あるいは</em>すでにキャッシュにはあるが(<q>only-if-cached</q> によって禁止されている)この文書が更新されているかどうかの再確認が必要です．
sv: Du har skickat en begäran med cachekontrolldirektivet <q>only-if-cached</q>. Dokumentet hittades inte i cachen, <em>eller</em> så krävdes en omvalidering som förbjöds av direktivet <q>only-if-cached</q>.

source: Your Web Browser configuration needs to be corrected to use this network.
sv: Din webbläsares konfiguration måste korrigeras för att kunna använda detta nätverk.

source: Your cache administrator is <a href="mailto:%w%W">%w</a>.
sv: Din cacheadministratör är <a href="mailto:%w%W">%w</a>.

source: Your cache administrator may be able to provide you with more details about the exact nature of the problem if needed.
sv: Din cacheadministratör kan vid behov ge dig mer information om problemets exakta natur.

source: Your webmaster is <a href="mailto:%w">%w</a>.
sv: Din webbansvarige är <a href="mailto:%w">%w</a>.

source: Zero Sized Reply
ja: サイズがゼロの応答
sv: Nollstorlekssvar
