Repository: squid-cache/squid
Catalog: errors/*.po
Languages: ja, sv

source: excluded subtree violation
sv: undantagen överträdelse i underträd

source: invalid non-CA certificate (has CA markings)
sv: ogiltigt icke-CA-certifikat (har CA-märkning)

source: invalid or inconsistent certificate extension
sv: ogiltig eller inkonsekvent certifikatutökning

source: invalid or inconsistent certificate policy extension
sv: ogiltig eller inkonsekvent certifikatutökning för policy

source: key usage does not include CRL signing
sv: nyckelanvändningen omfattar inte CRL-signering

source: key usage does not include digital signature
sv: nyckelanvändningen omfattar inte digital signatur

source: name constraints minimum and maximum not supported
sv: namnbegränsningar minimum och maximum stöds inte

source: no explicit policy
sv: ingen explicit policy

source: permitted subtree violation
sv: tillåten överträdelse av underträd

source: proxy certificates not allowed, please set the appropriate flag
sv: proxycertifikat är inte tillåtna, ställ in lämplig flagga

source: proxy path length constraint exceeded
sv: begränsning för proxysökvägens längd överstegs

source: unable to get CRL issuer certificate
sv: det går inte att hämta CRL-utfärdarcertifikatet

source: unhandled critical CRL extension
sv: ohanterad kritisk CRL-utökning

source: unhandled critical extension
sv: ohanterad kritisk utökning

source: unsupported name constraint type
sv: namnbegränsningstypen stöds inte

source: unsupported or invalid name constraint syntax
sv: syntax för namnbegränsning stöds inte eller är ogiltig

source: unsupported or invalid name syntax
sv: namnsyntaxen stöds inte eller är ogiltig

source: A Timeout occurred while waiting to read data from the network. The network or server may be down or congested. Please retry your request.
ja: ネットワークからデータを読もうと待っている間にタイムアウトが発生しました。ネットワークもしくはサーバが稼働していないか、あるいは混雑しています。再度リクエストしてください。

source: Access control configuration prevents your request from being allowed at this time. Please contact your service provider if you feel this is incorrect.
ja: 設定されているアクセス制御の設定のため、今回はあなたからのリクエストは受けつけられません。この設定が正しくないと思われる場合には、このサービスの提供者へ連絡してください。

source: An error condition occurred while reading data from the network. Please retry your request.
ja: ネットワークからデータを受信している間にエラーが発生しました。再度、リクエストしてください。

source: An error condition occurred while writing to the network. Please retry your request.
ja: ネットワークにデータを送信している間にエラーが発生しました。再度リクエストしてください。

source: Cache Access Denied.
ja: キャッシュへのアクセスを拒否されました．

source: Cache Manager Access Denied.
ja: キャッシュマネジャへのアクセスを拒否されました．

source: ERROR: The requested URN not be retrieved
ja: エラー: 要求されたURNからデータを取り出せませんでした。

source: FTP Directory Listing
ja: FTPのディレクトリの一覧

source: FTP Directory: %U
ja: FTP ディレクトリ: %U

source: FTP Directory: <a href="/">%U</a>/
ja: FTP ディレクトリ: <a href="/">%U</a>/

source: FTP PUT Successful: File Created
ja: FTPのPUTに成功: ファイルを作成しました。

source: FTP PUT/upload failed
ja: ファイルのPUTやアップロードに失敗

source: Parent Directory
ja: 親のディレクトリ

source: Please contact the <a href="mailto:%w%W">cache administrator</a> if you have difficulties authenticating yourself or <a href="http://%h/cgi-bin/chpasswd.cgi">change</a> your default password.
ja: あなた自身の認証やデフォルトのパスワードの<a href="http://%h/cgi-bin/chpasswd.cgi">変更</a>困難な場合は、<a href="mailto:%w%W">キャッシュの管理者</a>に連絡してください。

source: Squid does not support all request methods for all access protocols. For example, you can not POST a Gopher request.
ja: Squidはすべてのプロトコルに対して、すべてのリクエスト方式をサポートしているわけではありません。例えば、POSTをGopherのリクエストで行うことはできません。

source: The remote host or network may be down. Please try the request again.
ja: 接続先のホストもしくはネットワークが稼働していません．しばらく待ってからもう一度試して下さい．

source: There is no WAIS Relay host defined for this Cache! Yell at the administrator.
ja: WAIS リレー用ホストが定義されていません! 管理者に連絡してください．

source: This cache is in the process of shutting down and can not service your request at this time. Please retry your request again soon.
ja: このキャッシュは稼働停止の処理に入っていて、現在あなたのリクエストへのサービスを提供できません。後で再度リクエストしてください．

source: This cache will not forward your request because it is trying to enforce a sibling relationship. Perhaps the client at %i is a cache which has been misconfigured.
ja: キャッシュ間における関係を強制的に兄弟関係となるようにしているため，キャッシュはあなたのリクエストを転送できませんでした．%i のキャッシュが誤った設定となっているかもしれません．

source: This might be caused by an FTP URL with an absolute path (which does not comply with RFC 1738). If this is the cause, then the file can be found at <a href="%B">%B</a>.
ja: これは(RFC 1738に従っていない)絶対パスを含んだFTPのURLによる可能性があります。その場合に該当するなら、ファイルは<a href="%B">%B</a>に見つかるかもしれません。

source: While trying to PUT the following URL: <a href="%U">%U</a>
ja: 以下の URL を PUT しようとした際に: <a href="%U">%U</a>
